<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><title>6&nbsp;ClojureScript</title><link rel="stylesheet" type="text/css" href="scribble.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-style.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-racket.css" title="default"/><script type="text/javascript" src="scribble-common.js"></script><script type="text/javascript" src="manual-racket.js"></script><!--[if IE 6]><style type="text/css">.SIEHidden { overflow: hidden; }</style><![endif]--></head><body id="scribble-racket-lang-org"><div class="tocset"><div class="tocview"><div class="tocviewlist tocviewlisttopspace"><div class="tocviewtitle"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_0&quot;);">&#9660;</a></td><td></td><td><a href="index.html" class="tocviewlink" data-pltdoc="x">Clojure Memo</a></td></tr></table></div><div class="tocviewsublistonly" style="display: block;" id="tocview_0"><table cellspacing="0" cellpadding="0"><tr><td align="right">1&nbsp;</td><td><a href="why-clojure.html" class="tocviewlink" data-pltdoc="x">Why Clojure?</a></td></tr><tr><td align="right">2&nbsp;</td><td><a href="var.html" class="tocviewlink" data-pltdoc="x">Vars</a></td></tr><tr><td align="right">3&nbsp;</td><td><a href="recursions.html" class="tocviewlink" data-pltdoc="x">Recursions</a></td></tr><tr><td align="right">4&nbsp;</td><td><a href="functional-programming.html" class="tocviewlink" data-pltdoc="x">Functional Programming</a></td></tr><tr><td align="right">5&nbsp;</td><td><a href="core-async.html" class="tocviewlink" data-pltdoc="x">core.async</a></td></tr><tr><td align="right">6&nbsp;</td><td><a href="" class="tocviewselflink" data-pltdoc="x">Clojure<span class="mywbr"> &nbsp;</span>Script</a></td></tr><tr><td align="right">7&nbsp;</td><td><a href="tips.html" class="tocviewlink" data-pltdoc="x">Tips</a></td></tr><tr><td align="right"></td><td><a href="doc-index.html" class="tocviewlink" data-pltdoc="x">Index</a></td></tr></table></div></div></div></div><div class="maincolumn"><div class="main"><div class="versionbox"><span class="version">6.2</span></div><div class="navsettop"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;</span><span class="navright">&nbsp;&nbsp;<a href="core-async.html" title="backward to &quot;5 core.async&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;Clojure Memo&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="tips.html" title="forward to &quot;7 Tips&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div><h3>6<tt>&nbsp;</tt><a name="(part._clojurescript)"></a>ClojureScript</h3><p>ClojureScript&#45716; Clojure&#51032; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944; &#48260;&#51204;&#51060;&#45796;. Clojure&#46972;&#45716; &#50616;&#50612;&#47484; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944; &#50644;&#51652;&#49345;&#50640;
&#44536;&#45824;&#47196; &#44396;&#54788;&#54644; &#45459;&#51008; &#44163;&#51060;&#45796;(dot NET &#49345;&#50640;&#49436; &#44396;&#54788;&#54620; Clojure CLR&#51060;&#46972;&#45716; &#50616;&#50612;&#46020; &#51080;&#45796;). &#44536;&#47000;&#49436;
&#47676;&#51200; Clojure&#47484; &#51061;&#54784;&#50556; &#54620;&#45796;&#45716; &#51216;&#51060; &#48512;&#45812;&#51060; &#46112; &#49688; &#51080;&#51648;&#47564;, &#44536; &#48372;&#49345;&#51008; &#44536; &#45432;&#47141;&#44284; &#49884;&#44036;&#51012;
&#49345;&#49604;&#54616;&#44256;&#46020; &#45224;&#51004;&#47532;&#46972; &#49373;&#44033;&#54620;&#45796;.  Clojure&#44032; &#51088;&#48148; &#50616;&#50612;&#47196; &#50416;&#50668;&#51256; &#51080;&#51648;&#47564;, &#51088;&#48148;&#50752;&#45716; &#54869;&#50672;&#55176; &#45796;&#47480;
&#50616;&#50612;&#51060;&#46319;&#51060;, ClojureScript&#46020; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944; &#50616;&#50612;&#47196; &#50416;&#50668;&#51256; &#51080;&#51648;&#47564;, &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#50752;&#45716; &#49345;&#45817;&#55176;
&#45796;&#47480; &#50616;&#50612;&#51060;&#45796;. &#51068;&#45800; &#47784;&#46304; &#51088;&#47308;&#54805;&#51060; immutable&#54805;&#51060;&#46972;&#45716; &#51216;&#51060; &#44032;&#51109; &#53360; &#52264;&#51060;&#51216;&#51060;&#45796;.</p><p>&#50836;&#51608; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#44032; &#45824;&#49464;&#47196; &#46888;&#44256; &#51080;&#44592;&#45716; &#54616;&#47564;, &#45208;&#45716; &#44060;&#51064;&#51201;&#51004;&#47196; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#47484; &#51339;&#51008; &#50616;&#50612;&#47196;
&#54217;&#44032;&#54616;&#44256; &#51080;&#51648; &#50506;&#45796;. &#51228;&#44032; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#47484; &#51339;&#50500;&#54616;&#51648; &#50506;&#45716; &#52395; &#48264;&#51704; &#51060;&#50976;&#45716;, &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#44032;
lexical scope language&#46972;&#44256;&#45716; &#54616;&#51648;&#47564;, this &#46972;&#45716; &#53412;&#50892;&#46300;&#47564;&#53372;&#51008; dynamic scope&#47196; &#51089;&#46041;&#54644;&#49436;,
&#54532;&#47196;&#44536;&#47016; &#49892;&#54665; &#51473;&#50640; this&#51032; binding&#51060; &#54532;&#47196;&#44536;&#47000;&#47672;&#50640; &#51032;&#54644; &#47560;&#51020;&#45824;&#47196; &#48148;&#45076; &#49688; &#51080;&#50612;, &#54532;&#47196;&#44536;&#47016;&#51032;
&#47196;&#51649;&#51012; &#54028;&#50501;&#54616;&#45716;&#45936; &#49345;&#45817;&#54620; &#50612;&#47140;&#50880;&#51012; &#50504;&#44200;&#51452;&#44256; &#51080;&#44592; &#46412;&#47928;&#51060;&#45796;. &#50612;&#46500; &#49324;&#46988;&#51008; this&#51032; &#51060;&#47084;&#54620;
dynamic binding&#51060;, &#51088;&#48148;&#49828;&#53356;&#47549;&#53944; &#54532;&#47196;&#44536;&#47000;&#48141;&#51012; &#44053;&#47141;&#54616;&#44172; &#54644; &#51452;&#45716; &#47924;&#44592;&#51064; &#44163;&#52376;&#47100; &#54252;&#51109;&#54616;&#45716;
&#49324;&#46988;&#46308;&#46020; &#51080;&#51648;&#47564;, goto&#47928;&#51060; &#45224;&#48156;&#46104;&#45716; &#50616;&#50612;&#44032; &#54532;&#47196;&#44536;&#47016;&#51032; &#51060;&#54644;&#47484; &#50612;&#47157;&#44172; &#54616;&#45716; &#44163;&#52376;&#47100;,
dynamic binding&#51060; &#45224;&#48156;&#46104;&#47732; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#51649;&#44288;&#51201;&#51064; &#51060;&#54644;&#47484; &#48169;&#54644;&#54616;&#45716; &#50836;&#49548;&#47196; &#51089;&#50857;&#54616;&#44592;&#50640;
&#44060;&#49548;&#47532;&#50640; &#51648;&#45208;&#51648; &#50506;&#45716;&#45796;&#44256; &#48376;&#45796;. &#54532;&#47196;&#44536;&#47016;&#51008; '&#49324;&#46988;'&#51060; &#51676;&#45716; &#44163;&#51060;&#45796;. &#44536;&#47000;&#49436; &#49324;&#46988;&#51060;
&#51060;&#54644;&#54616;&#44592; &#49772;&#50868; &#44396;&#51312;&#47196; &#54532;&#47196;&#44536;&#47000;&#48141;&#54624; &#49688; &#51080;&#46020;&#47197; &#50616;&#50612; &#51088;&#52404;&#44032; &#49444;&#44228;&#46104;&#50612; &#51080;&#50612;&#50556; &#54620;&#45796;&#44256;
&#49373;&#44033;&#54620;&#45796;. &#45208;&#45716; this &#51088;&#52404;&#44032; &#45208;&#49240;&#45796;&#44256;&#45716; &#49373;&#44033;&#54616;&#51648;&#45716; &#50506;&#45716;&#45796;. &#45824;&#48512;&#48516;&#51032; &#44061;&#52404; &#51648;&#54693; &#50616;&#50612;&#44032; &#51060;
this&#46972;&#45716; &#44060;&#45392; &#50948;&#50640; &#49444;&#44228;&#46104;&#50612; &#51080;&#51004;&#45768;, &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#47564;&#51032; &#45800;&#51216;&#51060;&#46972;&#44256; &#48372;&#44592;&#50640;&#45716; &#50612;&#47140;&#50868; &#47732;&#51060; &#51080;&#44592;
&#46412;&#47928;&#51077;&#51060;&#45796;. &#45236;&#44032; &#47928;&#51228;&#46972;&#44256; &#49373;&#44033;&#54616;&#45716; &#51216;&#51008;, &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#51032; this&#44032; &#44032;&#47532;&#53412;&#45716; &#44061;&#52404;&#44032; &#54532;&#47196;&#44536;&#47016; &#49892;&#54665;
&#51473;&#50640; &#48148;&#45076; &#49688; &#51080;&#45796;&#45716; &#44163;(dynamic binding)&#51060;&#45796;. &#44536;&#47000;&#49436; &#51060;&#47088; &#48169;&#49885;&#51012; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944; &#50616;&#50612; &#49444;&#44228;
&#52488;&#44592;&#48512;&#53552; &#48176;&#51228;&#54664;&#50632;&#51004;&#47732; &#44536;&#45208;&#47560; &#51339;&#50520;&#51012; &#44152; &#54616;&#45716; &#50500;&#49772;&#50880;&#51060; &#51080;&#45796;.</p><p>&#47932;&#47200;, ClojureScript&#50640;&#49436;&#46020; this&#47484; &#54252;&#54632;&#54644; Javascript&#51032; &#47784;&#46304; &#44592;&#45733;&#51012; &#48520;&#47084;&#45796; &#50424; &#49688;&#45716;
&#51080;&#51648;&#47564;, &#44536;&#47088; &#51109;&#52824;&#47484; &#44403;&#51060; &#47560;&#47144;&#54644; &#46164; &#51060;&#50976;&#45716;, ClojureScript&#50640;&#49436; &#50808;&#48512;&#51032; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;
&#46972;&#51060;&#48652;&#47084;&#47532;&#47484; &#49324;&#50857;&#54644;&#50556;&#47564; &#54624; &#46412;, &#50612;&#51796; &#49688; &#50630;&#51060; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#51032; &#44592;&#45733;&#51012; &#51060;&#50857;&#54644;&#50556;&#47564; &#54616;&#45716; &#44221;&#50864;&#50640;
&#49324;&#50857;&#54616;&#46972;&#45716; &#52712;&#51648;&#51068; &#49104;&#51060;&#45796;. &#44536;&#47088;&#45936; ClojureScript&#47196; &#54532;&#47196;&#44536;&#47000;&#48141;&#54624; &#46412;&#45716;, &#51060; this&#47484; &#44144;&#51032; &#49324;&#50857;&#54616;&#51648;
&#50506;&#45716;&#45796;. this&#51032; &#51452;&#50836; &#50857;&#46020;&#44032; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#50640;&#49436; &#44061;&#52404; &#51648;&#54693;&#51012; &#55001;&#45236;&#45236;&#44592; &#50948;&#54620; &#44163;(&#47716;&#48260; &#48320;&#49688;&#50640; &#45824;&#54620;
&#51217;&#44540; &#50857;&#46020;)&#51060;&#50612;&#49436;, &#49345;&#53468;(state)&#47484; &#52572;&#45824;&#54620; &#48176;&#51228;&#54616;&#44256;&#51088; &#54616;&#45716; &#54632;&#49688;&#54805; &#50616;&#50612;&#50640;&#49436;&#45716; &#49324;&#49892; &#50424; &#51068;&#51060;
&#48324;&#47196; &#50630;&#45796;. &#46384;&#46972;&#49436; &#44536;&#47564;&#53372; &#54532;&#47196;&#44536;&#47016;&#51032; &#47196;&#51649; &#54028;&#50501;&#51060; &#49688;&#50900;&#54644;&#51652;&#45796;. &#44172;&#45796;&#44032; &#49436;&#48260;&#47484; Clojure&#47196;
&#54532;&#47196;&#44536;&#47000;&#48141;&#54616;&#45716; &#44221;&#50864;, &#49436;&#48260;&#50752;&#51032; &#53685;&#49888;&#51060;&#46972;&#46304;&#44032;, &#49436;&#48260;&#50752;&#51032; &#53076;&#46300; &#44277;&#50976;&#44032; &#44032;&#45733;&#54644;&#51648;&#45716; &#46321;&#51032; &#51109;&#51216;&#51008;,
&#45796;&#47480; &#50616;&#50612;&#46308;&#50640;&#49436; &#46384;&#46972;&#50724;&#44592; &#55192;&#46304; &#44053;&#51216;&#51060;&#45796;. &#51060; &#44544;&#51012; &#50416;&#45796; &#48372;&#45768; &#44049;&#51088;&#44592; "Catch me, if you can"
&#51060;&#46972;&#45716; &#50689;&#54868;&#51032; &#51228;&#47785;&#51060; &#46496;&#50724;&#47480;&#45796;.</p><p>&#44536;&#47532;&#44256; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#47196;&#45716; &#50896;&#47000; &#47680;&#54000; &#50416;&#47112;&#46377;&#51060; &#48520;&#44032;&#45733;&#54620;&#45936;, ClojureScript&#51032; &#44221;&#50864;&#45716; core.async
&#46972;&#51060;&#48652;&#47084;&#47532;&#47484; &#49324;&#50857;&#54616;&#47732;, &#47560;&#52824; &#47680;&#54000; &#50416;&#47112;&#46377;&#51012; &#44396;&#54788;&#54616;&#45716; &#44163;&#44284; &#44057;&#51008; &#54952;&#44284;(go &#50616;&#50612;&#51032; go block&#44284;
&#44060;&#45392;&#51060; &#44057;&#45796;)&#47484; &#45572;&#47540; &#49688;&#46020; &#51080;&#45796;.</p><p>&#54620; &#47560;&#46356;&#47196;, ClojureScript&#45716; &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#51032; Funcitional Version&#51060;&#51088; Lisp Version&#51060;&#46972;&#44256; &#48372;&#47732;
&#46108;&#45796;. &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#47484; &#48320;&#50857;&#54620; &#50616;&#50612;&#44032; &#47566;&#51060; &#45208;&#50752; &#51080;&#51648;&#47564;, &#54632;&#49688;&#54805; &#50616;&#50612;&#51032; &#53945;&#49457;&#44284; &#47532;&#49845;&#51032; &#47588;&#53356;&#47196;&#47484;
&#48152;&#50689;&#54620; &#50616;&#50612;&#45716; ClojureScript&#44032; &#50976;&#51068;&#54620; &#44163;&#51004;&#47196; &#50508;&#44256; &#51080;&#45796;. &#54632;&#49688;&#54805; &#50616;&#50612;&#51032; &#44032;&#52824;&#50752; &#47532;&#49845; &#47588;&#53356;&#47196;&#51032;
&#50948;&#47141;&#51012; &#49892;&#44048;&#54616;&#44256; &#51080;&#45716; &#54532;&#47196;&#44536;&#47000;&#47672;&#46308;&#50640;&#44172;&#45716; &#51060; &#54620; &#47560;&#46356;&#50640; &#44480;&#44032; &#48264;&#51789; &#46888;&#51068;&#47564;&#54620; &#44053;&#51216;&#46308;&#51060;&#45796;.</p><p>&#45936;&#49828;&#53356;&#53457; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#44060;&#48156;&#51032; &#44221;&#50864;&#50640;&#46020;, ClojureScript&#51032; &#51060;&#50857; &#44032;&#52824;&#45716; &#45458;&#45796;. &#51060;&#51032; &#45824;&#54364;&#51201;&#51064;
&#49324;&#47168;&#44032; LightTable&#51060;&#46972;&#45716; &#54532;&#47196;&#44536;&#47016;&#51060;&#45796;. &#51060; &#54532;&#47196;&#44536;&#47016;&#51008; ClojureScript + node.js(local resource
&#51217;&#44540;) + node-webkit(Rendering engine on Google Chromium)&#51012; &#51312;&#54633;&#54644;&#49436; &#47564;&#46308;&#50632;&#45796;. &#51060;
&#54532;&#47196;&#44536;&#47016;&#51008; &#45936;&#49828;&#53356;&#53457; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51060;&#44592;&#45716; &#54616;&#51648;&#47564;, &#50937; &#48652;&#46972;&#50864;&#51200;&#47484; &#51088;&#52404; &#45236;&#51109;&#54620; &#54805;&#53468;&#51032;
&#54532;&#47196;&#44536;&#47016;&#51060;&#48064;&#47196;, &#49789;&#44172; &#50937; &#54532;&#47196;&#44536;&#47016;&#51004;&#47196; &#51204;&#54872;&#54624; &#49688; &#51080;&#45796;&#45716; &#51109;&#51216;&#46020; &#51080;&#45796;. &#51060;&#47088; &#51216;&#50640;&#49436;, &#51200;&#45716;
Clojure&#48372;&#45796;&#45716; ClojureScript&#51032; &#44032;&#45733;&#49457;&#51012; &#45908; &#45458;&#51060; &#48372;&#44256; &#51080;&#45796;. Clojure&#51032; &#44221;&#50864;&#50640;&#45716;, GUI
&#54532;&#47196;&#44536;&#47000;&#48141;&#51012; &#54616;&#44256;&#51088; &#54624; &#46412;, Java&#51032; swing&#51012; &#51060;&#50857;&#54616;&#45716; &#44163; &#51060;&#50808;&#50640;&#45716; &#54788;&#49892;&#51201;&#51064; &#45824;&#50504;&#51060; &#51316;&#51116;&#54616;&#51648;
&#50506;&#44256;, swing&#51060; &#44284;&#44144;&#50640; &#48708;&#54644; &#47566;&#51060; &#48744;&#46972;&#51276;&#45796;&#44256;&#45716; &#54616;&#51648;&#47564;, &#44592;&#51316;&#50640; &#51228;&#44277;&#46104;&#45716; Componenet&#51032; &#50808;&#44288;&#51012;
&#44060;&#48156;&#51088;&#44032; &#50896;&#54616;&#45716;&#45824;&#47196; &#48148;&#44984;&#44592;&#46020; &#49789;&#51648; &#50506;&#51012; &#49104;&#47564; &#50500;&#45768;&#46972;, &#49352;&#47196;&#50868; Component&#51032; &#52628;&#44032;&#46020; Java swing&#50640;
&#45824;&#54620; &#49345;&#45817;&#54620; &#51648;&#49885;&#51012; &#50836;&#44396;&#54616;&#45716; &#51068;&#51060;&#50612;&#49436; &#44208;&#53076; &#47564;&#47564;&#54620; &#51089;&#50629;&#51060; &#50500;&#45768;&#45796;. JRE&#47484; &#48324;&#46020;&#47196; &#44628;&#50500;&#50556; &#54616;&#45716;
&#44163;&#46020; &#49324;&#50857;&#51088;&#51032; &#51077;&#51109;&#50640;&#49436;&#45716; &#48264;&#44144;&#47196;&#50868; &#51068;&#51068; &#49688;&#46020; &#51080;&#45796;. &#44536;&#50640; &#48152;&#54644; ClojureScript&#47484; &#51060;&#50857;&#54620; Web
Programming&#51032; &#44221;&#50864;&#50640;&#45716;, &#50937; &#48652;&#46972;&#50864;&#51200;&#44032; &#51060;&#48120; &#51228;&#44277;&#54616;&#44256; &#51080;&#45716; GUI &#50836;&#49548;&#50640;, CSS&#47484; &#51060;&#50857;&#54644; &#50557;&#44036;&#51032;
&#49688;&#51221;&#47564; &#44032;&#54616;&#47732;, &#44060;&#48156;&#51088;&#44032; &#50896;&#54616;&#45716; GUI(&#51060; &#48516;&#50556;&#44032; &#50836;&#51608; &#45236;&#44032; &#44288;&#49900;&#51012; &#44054;&#44256; &#44060;&#48156;&#51012; &#49884;&#51089;&#54616;&#44256;&#51088; &#54616;&#45716;
&#48512;&#48516;&#51060;&#44592;&#46020; &#54616;&#45796;)&#47484; &#48708;&#44368;&#51201; &#49789;&#44172; &#44396;&#54788;&#54624; &#49688; &#51080;&#45796;. &#49695;&#44032;&#46973; &#54616;&#45208;&#47564; &#50617;&#51004;&#47732; &#46108;&#45796;&#44256; &#54624; &#51221;&#46020;&#47196;
&#44284;&#44144;&#50640; &#48708;&#54644; &#47566;&#51060; &#49688;&#50900;&#54644;&#51652; &#44163;&#51060;&#45796;. &#44172;&#45796;&#44032; React&#50640; &#44592;&#48152;&#54620; Reagent &#46972;&#51060;&#48652;&#47084;&#47532;&#47484; &#51060;&#50857;&#54616;&#47732;
&#45908;&#45908;&#50865; &#49772;&#50892;&#46360;&#45796;. Angular.js&#47484; &#51060;&#50857;&#54644; &#44396;&#54788;&#54616;&#45716; &#44163;&#48372;&#45796;, &#45208;&#51032; &#51452;&#44288;&#51201;&#51064; &#45712;&#45196;&#51060;&#44592;&#45716; &#54616;&#51648;&#47564;,
40-50&#48176;&#45716; &#45908; &#49789;&#45796;&#44256; &#54217;&#44032;&#54616;&#44256; &#51080;&#45796;. &#51060;&#47111;&#44172;&#44620;&#51648; &#47568;&#54624; &#49688; &#51080;&#45716; &#51060;&#50976;&#45716; &#54532;&#47196;&#44536;&#47016;&#51032; &#44396;&#51312;&#44032; &#47568;&#54624;
&#49688; &#50630;&#51060; &#45800;&#49692;&#54644;&#51648;&#44592; &#46412;&#47928;&#51060;&#45796;. &#44172;&#45796;&#44032; node.js&#47484; &#51201;&#51208;&#55176; &#51060;&#50857;&#54616;&#47732; &#50937; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51012; &#45936;&#49828;&#53356;&#53457;
&#50528;&#54540;&#47532;&#52992;&#51060;&#49496;&#51004;&#47196; &#49789;&#44172; &#51204;&#54872;&#46020; &#44032;&#45733;&#54616;&#45796;.</p><p>&#50500;&#50872;&#47084; ClojureScript &#50616;&#50612; &#44060;&#48156;&#51012; &#51452;&#46020;&#54616;&#44256; &#51080;&#45716; David Nolen&#51060; node.js&#50640; &#45824;&#54620; &#52980;&#54028;&#51068;&#47084;
&#52264;&#50896;&#50640;&#49436;&#51032; &#51648;&#50896;&#51012; &#44984;&#51456;&#55176; &#54616;&#44256; &#51080;&#45796;&#45716; &#51216;&#46020;, ClojureScript&#47484; &#51060;&#50857;&#54620; &#45936;&#49828;&#53356;&#53457; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496;
&#51228;&#51089;&#51032; &#44032;&#45733;&#49457;&#44284; &#51204;&#47581;&#51012; &#54620;&#52789; &#45458;&#44172; &#54644; &#51452;&#44256; &#51080;&#45796;.</p><p>&#53945;&#55176; &#50937; &#54532;&#47196;&#44536;&#47000;&#48141;&#54624; &#46412; Clojure&#50752; ClojureScript&#51032; &#51312;&#54633;&#51008; &#44032;&#55176; &#54872;&#49345;&#51201;&#51060;&#46972; &#54624; &#49688;
&#51080;&#45796;. &#49436;&#48260;&#51032; &#50616;&#50612;&#50752; &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; &#50616;&#50612;&#44032; &#44057;&#45796;&#45716; &#44163;&#51008; &#51060;&#47336; &#54756;&#50500;&#47540; &#49688; &#50630;&#45716; &#51109;&#51216;&#51012;
&#44054;&#45716;&#45796;. &#51060;&#47088; &#51109;&#51216;&#51012; &#44592;&#45824;&#54616;&#47728;, &#50612;&#46500; &#51060;&#46308;&#51008; Node.js&#47484; &#51060;&#50857;&#54644; &#49436;&#48260;&#50752; &#53364;&#46972;&#51060;&#50616;&#53944;&#47484;
&#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#47196; &#44060;&#48156;&#54616;&#47140;&#45716; &#49884;&#46020;&#47484; &#54616;&#44256; &#51080;&#45716;&#45936;, &#51088;&#48148;&#49828;&#53356;&#47549;&#53944;&#46972;&#45716; &#50616;&#50612;&#44032; &#54532;&#47196;&#44536;&#47000;&#48141;&#51032;
&#48373;&#51105;&#49457;&#51012; &#45720;&#47140;&#51452;&#47732; &#45720;&#47140;&#51452;&#50632;&#51648; &#51460;&#50668;&#51456;&#45796;&#44256;&#45716; &#48372;&#51648; &#50506;&#44592;&#50640;, &#44536;&#45796;&#51648; &#51339;&#51008; &#49440;&#53469;&#51004;&#47196;&#45716; &#48372;&#51060;&#51648;
&#50506;&#45716;&#45796;.</p><p>&#53945;&#55176;, Clojure&#47196; &#44036;&#45800;&#54620; &#50937; &#49436;&#48260; &#54532;&#47196;&#44536;&#47016;&#51012; &#44396;&#52629;&#54616;&#45716; &#45936;&#50640;&#45716; 30&#48516;&#46020; &#52292; &#44152;&#47532;&#51648; &#50506;&#45716;&#45796;. &#44592;&#45733;&#51012;
&#52628;&#44032;&#54616;&#45716; &#44163;&#46020; &#45800;&#49692;&#55176; &#54632;&#49688; &#47751; &#44060; &#52628;&#44032;&#54616;&#47732; &#44536;&#44163;&#51004;&#47196; &#45149;&#51060;&#45796;. &#48373;&#51105;&#54616;&#44172; &#53364;&#47000;&#49828; &#49444;&#44228;&#55184; &#54596;&#50836;&#44032;
&#50630;&#45796;. &#49888;&#54844; &#50668;&#54665;&#51012; &#51456;&#48708;&#54616;&#47728; &#47112;&#51060;&#49828;&#44032; &#50696;&#49240;&#44172; &#45804;&#47536; &#45800;&#52628; &#47566;&#51060; &#45804;&#47536; &#51104;&#50743;&#51012; &#52313;&#44592;&#44256; &#51080;&#45716; &#46392;&#51012;
&#48148;&#46972;&#48372;&#45912; &#50628;&#47560; &#50760;, "&#50584;&#50556;! &#49888;&#46993;&#51060; &#45800;&#52628; &#54400;&#45796;&#44032; &#48164; &#49352;&#44192;&#45796;."&#45716; &#50864;&#49828;&#44060; &#49548;&#47532;&#44032; &#51080;&#45716;&#45936;, &#54532;&#47196;&#44536;&#47016;
&#51676;&#46972;&#44256; &#54624; &#46412;, &#53364;&#47000;&#49828; getter/setter&#48512;&#53552; &#50676;&#49900;&#55176; &#47564;&#46308;&#44256; &#51080;&#45716; &#54532;&#47196;&#44536;&#47000;&#47672;&#46308;&#51012; &#48372;&#47732; &#51200;&#45716; &#44536;
&#45800;&#52628;&#44032; &#46496;&#50724;&#47480;&#45796;.</p><div class="navsetbottom"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;</span><span class="navright">&nbsp;&nbsp;<a href="core-async.html" title="backward to &quot;5 core.async&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;Clojure Memo&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="tips.html" title="forward to &quot;7 Tips&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div></div></div><div id="contextindicator">&nbsp;</div></body></html>