<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><title>2&nbsp;[Clojure] Recursion</title><link rel="stylesheet" type="text/css" href="scribble.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-style.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-racket.css" title="default"/><script type="text/javascript" src="scribble-common.js"></script><script type="text/javascript" src="manual-racket.js"></script><!--[if IE 6]><style type="text/css">.SIEHidden { overflow: hidden; }</style><![endif]--></head><body id="scribble-racket-lang-org"><div class="tocset"><div class="tocview"><div class="tocviewlist tocviewlisttopspace"><div class="tocviewtitle"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_0&quot;);">&#9660;</a></td><td></td><td><a href="index.html" class="tocviewlink" data-pltdoc="x">Clojure Memo</a></td></tr></table></div><div class="tocviewsublisttop" style="display: block;" id="tocview_0"><table cellspacing="0" cellpadding="0"><tr><td align="right">1&nbsp;</td><td><a href="var.html" class="tocviewlink" data-pltdoc="x">Vars</a></td></tr><tr><td align="right">2&nbsp;</td><td><a href="" class="tocviewselflink" data-pltdoc="x">[Clojure] Recursion</a></td></tr><tr><td align="right"></td><td><a href="doc-index.html" class="tocviewlink" data-pltdoc="x">Index</a></td></tr></table></div></div><div class="tocviewlist"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_1&quot;);">&#9658;</a></td><td>2&nbsp;</td><td><a href="" class="tocviewselflink" data-pltdoc="x">[Clojure] Recursion</a></td></tr></table><div class="tocviewsublistbottom" style="display: none;" id="tocview_1"><table cellspacing="0" cellpadding="0"><tr><td align="right">2.1&nbsp;</td><td><a href="#%28part._tail-recursion%29" class="tocviewlink" data-pltdoc="x">Tail Recursion(&#44844;&#47532; &#51116;&#44480;)</a></td></tr><tr><td align="right">2.2&nbsp;</td><td><a href="#%28part._mutual-tail-recursion-and-trampoline%29" class="tocviewlink" data-pltdoc="x">Mutual Tail Recursion(&#49345;&#54840; &#44844;&#47532; &#51116;&#44480;)&#44284; trampoline &#54632;&#49688;</a></td></tr><tr><td align="right">2.3&nbsp;</td><td><a href="#%28part.__________%29" class="tocviewlink" data-pltdoc="x">&#51116;&#44480; &#48169;&#49885;&#51032; &#48516;&#47448;</a></td></tr></table></div></div></div><div class="tocsub"><div class="tocsubtitle">On this page:</div><table class="tocsublist" cellspacing="0"><tr><td><span class="tocsublinknumber">2.1<tt>&nbsp;</tt></span><a href="#%28part._tail-recursion%29" class="tocsubseclink" data-pltdoc="x">Tail Recursion(&#44844;&#47532; &#51116;&#44480;)</a></td></tr><tr><td><span class="tocsublinknumber">2.2<tt>&nbsp;</tt></span><a href="#%28part._mutual-tail-recursion-and-trampoline%29" class="tocsubseclink" data-pltdoc="x">Mutual Tail Recursion(&#49345;&#54840; &#44844;&#47532; &#51116;&#44480;)&#44284; trampoline &#54632;&#49688;</a></td></tr><tr><td><span class="tocsublinknumber">2.3<tt>&nbsp;</tt></span><a href="#%28part.__________%29" class="tocsubseclink" data-pltdoc="x">&#51116;&#44480; &#48169;&#49885;&#51032; &#48516;&#47448;</a></td></tr><tr><td><span class="tocsublinknumber">2.3.1<tt>&nbsp;</tt></span><a href="#%28part._.Accumulator_passing_style%29" class="tocsubseclink" data-pltdoc="x">Accumulator passing style</a></td></tr><tr><td><span class="tocsublinknumber">2.3.2<tt>&nbsp;</tt></span><a href="#%28part._.Continuation_passing_style%29" class="tocsubseclink" data-pltdoc="x">Continuation passing style</a></td></tr></table></div></div><div class="maincolumn"><div class="main"><div class="navsettop"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;</span><span class="navright">&nbsp;&nbsp;<a href="var.html" title="backward to &quot;1 Vars&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;Clojure Memo&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="doc-index.html" title="forward to &quot;Index&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div><h3>2<tt>&nbsp;</tt><a name="(part._recursion)"></a>[Clojure] Recursion</h3><h4>2.1<tt>&nbsp;</tt><a name="(part._tail-recursion)"></a>Tail Recursion(&#44844;&#47532; &#51116;&#44480;)</h4><p>&#51116;&#44480;(recursion)&#46972;&#45716; &#44060;&#45392;&#51008;, C, C++ &#54841;&#51008; Java &#44057;&#51008; &#51068;&#48152; &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612;&#50640;&#46020; &#51316;&#51116;&#54616;&#51648;&#47564;,
&#49892;&#51228;&#51201;&#51004;&#47196;&#45716; &#51096; &#50416;&#51060;&#51648; &#50506;&#45716;&#45936;, &#44536; &#51060;&#50976;&#45716; &#51116;&#44480; &#54632;&#49688;&#51032; &#48152;&#48373;&#51201;&#51064; &#54840;&#52636;&#51060; stack overflow&#47484;
&#52488;&#47000;&#54616;&#44592; &#49789;&#44592; &#46412;&#47928;&#51060;&#45796;.</p><p>&#44536;&#47088;&#45936; &#51204;&#53685;&#51201;&#51004;&#47196; &#47532;&#49845; &#44228;&#50676;&#51032; &#50616;&#50612;&#50640;&#49436;&#45716;, &#44844;&#47532; &#54840;&#52636; &#52572;&#51201;&#54868;(Tail Call Optimization)&#46972;&#45716;
&#44592;&#48277;&#51012; &#53685;&#54644;, stack&#51012; &#51204;&#54784; &#49548;&#48708;&#54616;&#51648; &#50506;&#45716; &#48169;&#49885;&#51032; &#51116;&#44480; &#54840;&#52636; &#48169;&#49885;&#51012; &#44256;&#50504;&#54644; &#45256;&#45716;&#45936;, &#51060;&#47484; &#44844;&#47532;
&#51116;&#44480; (tail recursion)&#46972;&#44256; &#48512;&#47480;&#45796;(&#45800;, &#47784;&#46304; &#51333;&#47448;&#51032; &#51116;&#44480; &#54632;&#49688;&#47484; &#44844;&#47532; &#51116;&#44480; &#54632;&#49688;&#51032; &#54805;&#53468;&#47196; &#48148;&#44992;
&#49688; &#51080;&#45716; &#44163;&#51008; &#50500;&#45768;&#45796;). &#46384;&#46972;&#49436; &#44844;&#47532; &#54840;&#52636; &#52572;&#51201;&#54868; &#44592;&#48277;&#51012; &#51201;&#50857;&#54624; &#49688; &#51080;&#45716; &#51312;&#44148;&#50640; &#47582;&#44172;
&#54532;&#47196;&#44536;&#47000;&#47672;&#44032; &#51116;&#44480; &#54632;&#49688;&#47484; &#51089;&#49457;&#54616;&#47732;, &#52980;&#54028;&#51068;&#47084;&#44032; &#51060; &#54632;&#49688;&#47484;, stack overflow&#47484; &#51068;&#51004;&#53412;&#51648; &#50506;&#45716;
&#54632;&#49688;&#47196; &#51088;&#46041;&#51004;&#47196; &#48320;&#54872;&#54644; &#51456;&#45796;. &#51060; &#44284;&#51221;&#51012; TCO(Tail Call Optimization: &#44844;&#47532; &#54840;&#52636; &#52572;&#51201;&#54868;)&#46972;&#44256;
&#48512;&#47480;&#45796;.</p><p>&#51060; TCO &#44592;&#48277;&#51008; &#52980;&#54028;&#51068;&#47084; &#52264;&#50896;&#50640;&#49436; &#51648;&#50896;&#46104;&#50612;&#50556; &#54616;&#45716; &#44592;&#45733;&#51004;&#47196;, Lisp &#44228;&#50676; &#50616;&#50612;&#46308;&#50640;&#49436; &#52572;&#52488;&#47196;
&#49884;&#46020;&#46108; &#51060; &#44592;&#48277;&#51008; &#52572;&#44540;&#50640;&#50556; &#45796;&#47480; &#50616;&#50612;&#46308;&#51032; &#52980;&#54028;&#51068;&#47084;&#50640;&#49436;&#46020; &#51648;&#50896;&#54616;&#44592; &#49884;&#51089;&#54616;&#44256; &#51080;&#45716;&#45936;, &#44536; &#51473;&#50640;&#45716;
GNU gcc &#52980;&#54028;&#51068;&#47084;&#46020; &#51080;&#45796;.</p><p>&#51068;&#45800; &#51116;&#44480; &#54632;&#49688;&#51032; &#50696;&#48512;&#53552; &#49332;&#54196;&#48372;&#51088;. &#51116;&#44480; &#54632;&#49688;&#47484; &#49444;&#47749;&#54624; &#46468;, &#44032;&#51109; &#47566;&#51060; &#50696;&#47196; &#46300;&#45716; factorial
&#54632;&#49688;&#47484; &#44396;&#54788;&#54644; &#48372;&#47732; &#45796;&#51020;&#44284; &#44057;&#45796;.</p><p><pre class="codeblock">(defn fact-1
  [n]
  (if (&lt; n 2)
      1                                 ; (1)
      (*' n (fact-1 (dec n))) ))
      ;--                                 (2)
                    ;-------              (3)
           ;-----------------             (4)
      ;-------------------------          (5)

(fact-1 5)
; =&gt; 120

(fact-1 10000)
; =&gt; [Thrown class java.lang.StackOverflowError]</pre></p><ul><li><p>(2)&#50640;&#49436; &#44273;&#49480;&#51012; &#49688;&#54665;&#54624; &#46412;, &#54632;&#49688; <span class="stt">*</span>&#47484; &#49324;&#50857;&#54616;&#51648; &#50506;&#44256; <span class="stt">*'</span>&#47484; &#49324;&#50857;&#54620; &#51060;&#50976;:
Clojure 1.3 version &#51060;&#51204;&#50640;&#45716; <span class="stt">*'</span> &#54632;&#49688;&#44032; &#50630;&#50632;&#45796;. &#44536;&#46412;&#50640;&#45716; Clojure&#51032; &#51221;&#49688;&#51032; &#44592;&#48376;&#54805;&#51008;
Java&#51032; Integer&#54805;(4&#48148;&#51060;&#53944; &#51221;&#49688;&#54805;)&#51060;&#50632;&#44256;, &#50672;&#49328; &#46020;&#51473;&#50640; &#51060; Integer&#54805;&#51032; &#48276;&#50948;&#47484; &#45336;&#50612;&#49436;&#45716; &#44050;&#51060;
&#45208;&#50724;&#47732;, &#51088;&#46041;&#51004;&#47196; Java&#51032; BigInteger&#54805;&#51004;&#47196; &#48320;&#54872;&#51060; &#51060;&#47336;&#50612;&#51276;&#45796;. &#44536;&#47088;&#45936; Clojure 1.3 &#48260;&#51204;
&#51060;&#54980;&#47196;&#45716;, Clojure&#51032; &#51221;&#49688;&#51032; &#44592;&#48376;&#54805;&#51060; Java&#51032; Long&#54805;(8&#48148;&#51060;&#53944; &#51221;&#49688;&#54805;)&#51004;&#47196; &#48148;&#45068;&#50632;&#51012; &#49104;&#47564;
&#50500;&#45768;&#46972;, &#54632;&#49688; <span class="stt">*</span>&#45716; &#50672;&#49328; &#46020;&#51473; overflow&#44032; &#51068;&#50612;&#45208;&#47732; integer overflow ArithmeticException&#51060;
&#48156;&#49373;&#54624; &#49104;, Java&#51032; BigInteger&#54805;&#51004;&#47196;&#51032; &#48320;&#54872;&#51060; &#51088;&#46041;&#51004;&#47196; &#51060;&#47336;&#50612;&#51648;&#51648; &#50506;&#44172; &#48320;&#44221;&#46104;&#50632;&#45796;. &#51060;&#45716;
Clojure&#51032; &#51204;&#48152;&#51201;&#51064; &#49892;&#54665; &#49549;&#46020;&#47484; &#45132;&#50612;&#50732;&#47532;&#44592; &#50948;&#54620; &#51312;&#52824;&#51032; &#51068;&#54872;&#51004;&#47196; &#51060;&#54644;&#46108;&#45796;. &#48152;&#47732;&#50640; &#54632;&#49688;
<span class="stt">*'</span>&#45716; Java&#51032; BigInteger&#54805;&#51004;&#47196;&#51032; &#48320;&#54872;&#51060; &#51088;&#46041;&#51004;&#47196; &#51068;&#50612;&#45208;&#48064;&#47196;, Java&#51032; Long&#54805;&#51012; &#48279;&#50612;&#45208;&#45716; &#53360;
&#49688;&#47484; &#45796;&#47336;&#50612;&#50556; &#54616;&#45716; &#44221;&#50864;&#50640;&#45716; <span class="stt">*'</span> &#54632;&#49688;&#47484; &#49324;&#50857;&#54616;&#45716; &#44163;&#51060; &#48148;&#46988;&#51649;&#54616;&#45796;.</p></li></ul><p>&#44536;&#47088;&#45936; &#50948;&#50640;&#49436; &#51221;&#51032;&#54620; <span class="stt">fact-1</span> &#54632;&#49688;&#45716;, &#44844;&#47532; &#51116;&#44480; &#54632;&#49688;&#44032; &#50500;&#45768;&#45796;. &#55124;&#55176;&#46308; &#44844;&#47532; &#48512;&#50948;&#46972;&#44256;
&#54616;&#47732;, &#50948;&#51032; &#53076;&#46300; &#51473;&#50640;, (3) &#46608;&#45716; (4) &#48512;&#48516;&#51012; &#44844;&#47532;&#46972;&#44256; &#49373;&#44033;&#54616;&#44592; &#49772;&#50868;&#45936;, &#54632;&#49688;&#51032; &#47568;&#45800; &#48512;&#48516;&#50640;
&#50948;&#52824;&#54644; &#51080;&#45796;&#44256; &#54644;&#49436; &#44536; &#48512;&#48516;&#51012; &#47924;&#51312;&#44148; &#44844;&#47532;&#46972;&#44256; &#54616;&#51648;&#45716; &#50506;&#45716;&#45796;&#45716; &#51216;&#50640; &#51452;&#51032;&#54644;&#50556; &#54620;&#45796;. &#44844;&#47532;
&#51116;&#44480;&#50640;&#49436;, '&#44844;&#47532;'&#51032; &#44032;&#51109; &#51221;&#54869;&#54620; &#44060;&#45392;&#51008; '&#54632;&#49688;&#44032; &#52572;&#51333;&#51201;&#51004;&#47196; &#47532;&#53556;&#44050;&#51012; &#48152;&#54872;&#54616;&#45716; &#44275;'&#51012;
&#51068;&#52971;&#45716;&#45796;. &#51221;&#54869;&#55176; &#47568;&#54616;&#51088;&#47732;, &#50948;&#51032; &#53076;&#46300;&#50640;&#49436; &#44844;&#47532; &#48512;&#48516;&#51008; (1)&#44284; (5)&#51032; &#46160; &#48512;&#48516;&#51060;&#45796;. &#51060; &#46160; &#48512;&#48516;
&#47784;&#46160; &#51060; &#54632;&#49688;&#44032; &#52572;&#51333;&#51201;&#51004;&#47196; &#47532;&#53556;&#44050;&#51012; &#48152;&#54872;&#54616;&#45716; &#44275;&#51060;&#44592; &#46412;&#47928;&#51060;&#45796;. &#51060; &#46160; &#51088;&#47532; &#51473; &#50612;&#45712; &#54620; &#44275;&#50640;,
<span class="stt">fact-1</span> &#54632;&#49688;&#47484; &#45796;&#49884; &#54840;&#52636;&#54616;&#45716; &#53076;&#46300;&#44032; &#51080;&#50612;&#50556;, &#44844;&#47532; &#51116;&#44480; &#54632;&#49688;&#51032; &#51312;&#44148;&#51012; &#52649;&#51313;&#49884;&#53412;&#44172;
&#46108;&#45796;. &#46384;&#46972;&#49436; &#50948;&#51032; &#53076;&#46300;&#45716; &#44844;&#47532; &#51116;&#44480;&#54632;&#49688;&#51032; &#54805;&#53468;&#44032; &#50500;&#45768;&#45796;. &#44536;&#47000;&#49436; 10000&#44284; &#44057;&#51008; &#53360; &#49688;&#47484; &#51064;&#49688;&#47196;
&#51452;&#44256; &#54632;&#49688;&#47484; &#49892;&#54665;&#54616;&#45768;, StackOverflowError&#44032; &#48156;&#49373;&#54616;&#50688;&#45796;.</p><p>&#44536;&#47084;&#47732; &#50948;&#51032; &#53076;&#46300;&#47484; &#44844;&#47532; &#51116;&#44480;&#51032; &#54805;&#53468;&#47196; &#48148;&#44984;&#50612; &#48372;&#51088;.</p><p><pre class="codeblock">(defn fact-2
  ([n] (fact-2 n 1))   ; &#51064;&#49688;&#51032; &#44060;&#49688;&#44032; &#54620; &#44060;&#51068; &#46412; &#54840;&#52636;
  ([n acc]             ; &#51064;&#49688;&#51032; &#44060;&#49688;&#44032; &#46160; &#44060;&#51068; &#46412; &#54840;&#52636;
    (if (&lt; n 2)
        acc
        (fact-2 (dec n) (*' n acc)) )))
       ;---------------------------      (1)

(fact-2 5)       ; (2)
; =&gt; 120

(fact-2 10000)   ; (3)
; =&gt;   [Thrown class java.lang.StackOverflowError]</pre></p><ul><li><p>(2)&#50640;&#49436; <span class="stt">fact-2</span>&#51032; &#51064;&#49688;&#44032; &#54616;&#45208;&#51060;&#48064;&#47196;, &#46972;&#51064; 2&#51032; &#54632;&#49688;&#47484; &#54840;&#52636;&#54620;&#45796;. &#44536;&#47088;&#45936;
&#46972;&#51064; 2&#50640;&#49436;&#45716;, &#51064;&#49688;&#44032; 2&#44060;&#51064; &#54632;&#49688;, &#46972;&#51064; 3&#51012; &#45796;&#49884; &#54840;&#52636;&#54620;&#45796;. &#51060;&#46412; &#51064;&#49688; <span class="stt">acc</span>(accumulator)&#51032;
&#44050;&#51060; 1&#47196; &#52488;&#44592;&#54868;&#46108; &#49345;&#53468;&#47196; &#46972;&#51064; 3&#51012; &#54840;&#52636;&#54616;&#44172; &#46108;&#45796;. Clojure&#50640;&#49436;&#45716; &#51064;&#49688;&#51032; &#44060;&#49688;&#50640; &#46384;&#46972; &#44033;&#44033;
&#45796;&#47476;&#44172; &#54632;&#49688;&#47484; &#51221;&#51032;&#54624; &#49688; &#51080;&#45796;. &#51060;&#44163;&#51008; C++/Java&#50640;&#49436;&#51032; function overloading&#44284; &#50976;&#49324;&#54616;&#51648;&#47564;,
&#51064;&#49688;&#51032; &#45936;&#51060;&#53552;&#54805;&#44284;&#45716; &#44288;&#44228; &#50630;&#51060;, &#50724;&#51649; &#51064;&#49688;&#51032; &#44060;&#49688;&#47564;&#51012; &#46384;&#51256; &#44536;&#50640; &#49345;&#51025;&#54616;&#45716; &#54632;&#49688; &#51221;&#51032;&#47484;
&#54840;&#52636;&#54620;&#45796;&#45716; &#51216;&#50640;&#49436;&#45716;, C++/Java&#51032; function overloading&#44284; &#45796;&#47476;&#45796;.</p></li></ul><p>&#50948;&#51032; &#53076;&#46300;&#50640;&#49436;&#45716;, (1)&#47196; &#54364;&#49884;&#46108; &#44844;&#47532;&#51032; &#50948;&#52824;&#50640; <span class="stt">fact-2</span> &#54632;&#49688;&#44032; &#45796;&#49884; &#50948;&#52824;&#54644; &#51080;&#51004;&#48064;&#47196;, &#51060;
&#54632;&#49688;&#45716; &#44844;&#47532; &#51116;&#44480; &#54632;&#49688;&#51032; &#51312;&#44148;&#51012; &#52649;&#51313;&#49884;&#53416; &#53076;&#46300;&#51060;&#45796;. &#44844;&#47532; &#51116;&#44480; &#54632;&#49688; &#51060;&#54644;&#51032; &#54645;&#49900;&#51008;, &#44228;&#49328; &#51473;&#50640;
&#48156;&#49373;&#54616;&#45716; &#47784;&#46304; &#49345;&#53468;(state) &#44050;&#51012; '&#54632;&#49688;&#51032; &#51064;&#49688; &#54805;&#53468;'&#47196; &#44148;&#45348;&#51468;&#51004;&#47196;&#50024;, &#51116;&#44480; &#54632;&#49688; &#45236;&#48512;&#50640; &#50612;&#46496;&#54620;
&#49345;&#53468;(state) &#44050;&#46020; &#51648;&#45768;&#51648; &#50506;&#44172; &#54616;&#45716; &#45936; &#51080;&#45796;. &#50948;&#51032; &#53076;&#46300;&#50640;&#49436;&#45716;, &#51116;&#44480; &#54840;&#52636; &#46412;&#47560;&#45796;&#51032; &#44228;&#49328;
&#44208;&#44284;(&#49345;&#53468; &#44050; <span class="stt">n</span>&#44284; <span class="stt">acc</span>) &#44050;&#51012;, <span class="stt">fact-2</span>&#51032; &#51064;&#49688;&#47196; &#45796;&#49884; &#51204;&#45804;&#54616;&#44256; &#51080;&#51020;&#50640; &#51452;&#47785;&#54644;&#50556;
&#54620;&#45796;.</p><p>&#44536;&#47088;&#45936; (3)&#51032; &#49892;&#54665; &#44208;&#44284;&#47484; &#48372;&#47732;, &#50668;&#51204;&#55176; StackOverflowError&#44032; &#48156;&#49373;&#54616;&#44256; &#51080;&#45796;. &#47564;&#50557; &#50948;&#51032; &#53076;&#46300;&#44032;
Common Lisp&#51060;&#45208; Scheme &#50616;&#50612;&#47196; &#51089;&#49457;&#46104;&#50632;&#45796;&#47732;, &#51060; &#50616;&#50612;&#46308;&#51032; &#52980;&#54028;&#51068;&#47084;&#46308;&#51008; (1)&#51032; &#48512;&#48516;&#51060; TCO&#47484;
&#51201;&#50857;&#54624; &#49688; &#51080;&#45716; &#48512;&#48516;&#51076;&#51012; &#50508;&#50500;&#52292;&#44256;, &#51060; &#54632;&#49688;&#47484; stack&#51012; &#49548;&#47784;&#54616;&#51648; &#50506;&#45716; &#54632;&#49688;&#47196; '&#51088;&#46041;&#51004;&#47196;'
&#48320;&#54872;&#54616;&#45716; &#51089;&#50629;&#51012; &#49688;&#54665;&#54644; &#51452;&#48064;&#47196;, StackOverflowError&#44032; &#48156;&#49373;&#54616;&#51648; &#50506;&#45716;&#45796;. &#54616;&#51648;&#47564; Clojure&#50640;&#49436;&#45716;
&#54532;&#47196;&#44536;&#47000;&#47672;&#44032; '&#49688;&#46041;&#51004;&#47196;' &#44844;&#47532; &#51116;&#44480;&#47484; &#54616;&#45716; &#48512;&#48516;&#51060;&#46972;&#45716; &#44163;&#51012; &#52980;&#54028;&#51068;&#47084;&#50640;&#44172;
'&#47749;&#49884;&#51201;&#51004;&#47196;' &#50508;&#47140; &#51452;&#50612;&#50556;&#47564; &#54616;&#45716;&#45936;, special-form&#51064; <span class="stt">recur</span>&#44032; &#51060; &#50669;&#54624;&#51012; &#49688;&#54665;&#54620;&#45796;.</p><p>&#44536;&#47000;&#49436; &#45796;&#51020;&#44284; &#44057;&#51060; &#53076;&#46300;&#47484; &#49688;&#51221;&#54644;&#50556; StackOverflowError&#44032; &#48156;&#49373;&#54616;&#51648; &#50506;&#45716;&#45796;.</p><p><pre class="codeblock">(defn fact-3
  ([n] (fact-3 n 1))
  ([n acc]
   (if (&lt; n 2)
       acc
       (recur (dec n) (*' n acc)) )))

(fact-3 5)
; =&gt; 120

(fact-3 10000)
;; =&gt; 28462596809170545189064132......</pre></p><p>&#50526;&#50640;&#49436;&#46020; &#50616;&#44553;&#54664;&#46319;&#51060;, TCO &#44592;&#45733;&#51008; &#52980;&#54028;&#51068;&#47084; &#49688;&#51456;&#50640;&#49436; &#51648;&#50896;&#54644;&#50556; &#54616;&#45716; &#44592;&#45733;&#51060;&#45796;. &#44536;&#47088;&#45936; Clojure&#44032;
&#44592;&#48152;&#54616;&#44256; &#51080;&#45716; Java&#51032; &#52980;&#54028;&#51068;&#47084;&#45716; &#51088;&#52404;&#51201;&#51004;&#47196; &#51060; TCO &#44592;&#45733;&#51012; &#51648;&#50896;&#54616;&#51648; &#50506;&#50520;&#45796;. &#44536;&#47000;&#49436; &#51060; &#44592;&#45733;&#51008;
Clojure &#52980;&#54028;&#51068;&#47084;&#44032; &#48324;&#46020;&#47196; &#51648;&#50896;&#54624; &#49688; &#48150;&#50640; &#50630;&#50632;&#45716;&#45936;, Clojure &#50616;&#50612;&#51032; &#52285;&#49884;&#51088;&#51064; Rich
Hickey&#45716;, &#54532;&#47196;&#44536;&#47000;&#47672;&#44032; special-form&#51064; <span class="stt">recur</span>&#47484; &#53685;&#54644; &#51649;&#51217; '&#49688;&#46041;&#51004;&#47196;' Tail Recursion&#51012;
&#51648;&#51221;&#54616;&#45716; &#48169;&#49885;&#51012; &#53469;&#54664;&#45796;. &#51060;&#47196;&#48512;&#53552; &#50619;&#45716; &#51060;&#51216;&#51008;, &#53076;&#46300;&#47484; &#48516;&#49437;&#54624; &#46412; <span class="stt">recur</span> &#54840;&#52636;&#51060; &#51080;&#51004;&#47732;,
&#44844;&#47532; &#51116;&#44480; &#54632;&#49688;&#51076;&#51012; &#44263;&#48148;&#47196; &#54028;&#50501;&#54624; &#49688; &#51080;&#45796;&#45716; &#45936; &#51080;&#45796;. &#48152;&#47732;&#50640;, Common Lisp&#51060;&#45208; Scheme&#51032;
&#44221;&#50864;&#50640;&#45716;, &#44844;&#47532; &#51116;&#44480; &#54632;&#49688; &#52572;&#51201;&#54868; &#44592;&#48277;&#51060; &#49892;&#51228;&#47196; &#51201;&#50857;&#46104;&#45716; &#44221;&#50864;&#51064;&#51648; &#50500;&#45772;&#51648;&#47484; &#54028;&#50501;&#54616;&#47140;&#47732;,
&#53076;&#46300;&#47484; &#51068;&#51068;&#51060; &#45436;&#47532;&#51201;&#51004;&#47196; &#48516;&#49437;&#54644; &#48372;&#50500;&#50556;&#47564; &#54620;&#45796;.</p><h4>2.2<tt>&nbsp;</tt><a name="(part._mutual-tail-recursion-and-trampoline)"></a>Mutual Tail Recursion(&#49345;&#54840; &#44844;&#47532; &#51116;&#44480;)&#44284; trampoline &#54632;&#49688;</h4><p>&#54532;&#47196;&#44536;&#47016;&#51012; &#51676;&#45796; &#48372;&#47732; &#54632;&#49688; A&#44032; &#54632;&#49688; B&#47484; &#54840;&#52636;&#54616;&#44256;, &#54632;&#49688; B&#44032; &#45796;&#49884; &#54632;&#49688; A&#47484; &#54840;&#52636;&#54644;&#50556; &#54616;&#45716;
&#44221;&#50864;&#44032; &#48156;&#49373;&#54616;&#44592;&#46020; &#54620;&#45796;. &#51060;&#47088; &#44221;&#50864;&#47484; Mutual Recursion(&#49345;&#54840; &#51116;&#44480;)&#46972;&#44256; &#54616;&#45716;&#45936;, &#45796;&#51020;&#51032; &#53076;&#46300;&#44032;
&#44536; &#54620; &#50696;&#51060;&#45796;.</p><p><pre class="codeblock">(declare my-odd?-1)   ; &#51204;&#48169; &#49440;&#50616;

(defn my-even?-1 [n]
  (if (zero? n)
    true
    (my-odd?-1 (dec (Math/abs n))) ))    ; (1)

(defn my-odd?-1 [n]
  (if (zero? n)
    false
    (my-even?-1 (dec (Math/abs n))) ))   ; (2)

(my-even?-1 10)   ;=&gt; true
(my-odd?-1  10)   ;=&gt; false

(my-odd?-1 10000)
; =&gt; [Thrown class java.lang.StackOverflowError]</pre></p><p>&#51064;&#49688;&#51032; &#44050;&#51012; &#53356;&#44172; &#45458;&#51060;&#51088;, &#50696;&#50808; &#50630;&#51060; StackOverflowError&#44032; &#48156;&#49373;&#54616;&#50688;&#45796;. &#51060; &#47928;&#51228;&#47484; &#54644;&#44208;&#54616;&#47140;&#47732;,
Mutual Tail Recursion &#54632;&#49688;&#47484; &#51089;&#49457;&#54644;&#50556; &#54616;&#45716;&#45936;, Clojure&#50640;&#49436;&#45716;, &#50948;&#51032; (1)&#44284; (2)&#47484;, &#50500;&#47000;&#51032;
(3)&#44284; (4)&#52376;&#47100; &#51061;&#47749; &#54632;&#49688;(anonymous function)&#51032; &#54805;&#53468;&#47196; &#48320;&#44221;&#54644; &#51456; &#54980;&#50640;, <span class="stt">trampoline</span>
&#54632;&#49688;&#47484; &#53685;&#54644; &#54840;&#52636;&#54644; &#51452;&#47732; &#46108;&#45796;. &#45796;&#49884; &#47568;&#54644;, <span class="stt">trampoline</span> &#54632;&#49688;&#45716; mutual tail recursion
&#54840;&#52636;&#51012; &#44396;&#54788;&#54616;&#44592; &#50948;&#54644; Clojure&#50640; &#46020;&#51077;&#46108; &#54632;&#49688;&#45796;.</p><p>&#50668;&#44592;&#49436; &#44032;&#51109; &#51473;&#50836;&#54620; &#51216;&#51008;, &#50948;&#51032; (1)&#51032; &#44221;&#50864;&#50640; <span class="stt">(my-odd?-1 ...)</span> &#53076;&#46300;&#45716;, &#51060;&#48120; &#51221;&#51032;&#46104;&#50612; &#51080;&#45716;
&#44592;&#51316;&#51032; &#54632;&#49688; <span class="stt">my-odd?-1</span>&#51012;, &#45800;&#51648; &#48152;&#48373;&#54644;&#49436; &#54840;&#52636;&#54616;&#45716; &#44163;&#51076;&#50640; &#48152;&#54644;, &#50500;&#47000;&#51032; (3)&#51032;
<span class="stt">#(my-odd?-2 ...)</span> &#53076;&#46300;&#45716;, &#49892;&#54665;&#46112; &#46412;&#47560;&#45796; &#47588;&#48264; '&#49352;&#47196; &#49373;&#49457;'&#46108; &#51061;&#47749; &#54632;&#49688; &#44061;&#52404;&#47484; &#47532;&#53556;&#44050;&#51004;&#47196;
&#48152;&#54872;&#54616;&#45716; &#45936; &#51080;&#45796;. &#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#50640;&#49436;&#45716; &#51060;&#50752;&#44057;&#51060; &#53076;&#46300; &#49892;&#54665; &#51473;&#50640; &#49352;&#47196;&#50868; &#54632;&#49688;&#47484; &#46041;&#51201;&#51004;&#47196;
&#49373;&#49457;&#54624; &#49688; &#51080;&#45716;&#45936;, &#51060; &#52264;&#51060;&#51216;&#51012; &#51221;&#54869;&#54616;&#44172; &#51060;&#54644;&#54616;&#51648; &#47803;&#54616;&#47732;, &#50500;&#47000;&#51032; &#53076;&#46300;&#47484; &#51060;&#54644;&#54616;&#45716;&#45936; &#51648;&#51109;&#51060;
&#51080;&#51012; &#44163;&#51060;&#45796;.</p><p>&#51060; &#49352;&#47196; &#49373;&#49457;&#46108; &#54632;&#49688; &#44061;&#52404; &#50504;&#50640;, &#51060;&#51204; &#45800;&#44228;&#50640;&#49436; &#52376;&#47532;&#54620; state(&#49345;&#53468; &#44050;)&#47484; &#51200;&#51109;&#54620; &#54980;&#50640;, &#51060;
&#44061;&#52404;&#47484; '&#45796;&#51020; &#45800;&#44228;&#50640; &#49892;&#54665;&#46112; &#54632;&#49688;'&#51032; '&#51064;&#49688;' &#54805;&#53468;&#47196; &#45336;&#44592;&#44172; &#46104;&#48064;&#47196;, stack&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#44172;
&#47564;&#46304;&#45796;.</p><p><pre class="codeblock">(declare my-odd?-2)   ; &#51204;&#48169; &#49440;&#50616;

(defn my-even?-2 [n]
  (if (zero? n)
    true
    #(my-odd?-2 (dec (Math/abs n))) ))    ; (3)

(defn my-odd?-2 [n]
  (if (zero? n)
    false
    #(my-even?-2 (dec (Math/abs n))) ))   : (4)

(trampoline my-even?-2 10000)   ;=&gt; true
(trampoline my-odd?-2  10000)   ;=&gt; false</pre></p><p>&#44536;&#47088;&#45936; <span class="stt">my-even?-2</span> &#46608;&#45716; <span class="stt">my-odd?-2</span> &#54632;&#49688;&#47484; &#54840;&#52636;&#54624; &#46412;&#47560;&#45796;, <span class="stt">trampoline</span> &#54632;&#49688;&#47484;
&#44221;&#50976;&#54644;&#49436; &#54840;&#52636;&#54644;&#50556; &#54620;&#45796;&#47732;, &#44536;&#44163;&#46020; &#49345;&#45817;&#55176; &#49457;&#44032;&#49888; &#51068;&#51076;&#50640; &#53952;&#47548;&#50630;&#45796;. &#44536;&#47000;&#49436; &#50948;&#51032;
<span class="stt">my-even?-2</span>&#50752; <span class="stt">my-odd?-2</span> &#54632;&#49688; &#51221;&#51032;&#48512;&#47484;, &#45796;&#51020;&#44284; &#44057;&#51060; &#51648;&#50669; &#54632;&#49688; <span class="stt">e?</span>&#50752; <span class="stt">o?</span>&#47196;
&#48148;&#44988; &#54980;&#50640;, <span class="stt">my-even?</span> &#54632;&#49688;&#51032; &#45236;&#48512;&#50640;&#49436; <span class="stt">trampoline</span> &#54632;&#49688;&#47484; &#54840;&#52636;&#54616;&#46020;&#47197; &#54616;&#45716; &#44163;&#51060; &#45908;
&#45208;&#51008; &#48169;&#49885;&#51060;&#45796;.</p><p><pre class="codeblock">(defn my-even? [n]
  (letfn [(e? [n]
              (if (zero? n)
                true
                #(o? (dec (Math/abs n))) ))
          (o? [n]
              (if (zero? n)
                false
                #(e? (dec (Math/abs n))) ))]
    (trampoline e? n) ))

(defn my-odd? [n]
  (not (my-even? n)))

(my-even? 10000)   ;=&gt; true
(my-odd?  10000)   ;=&gt; false</pre></p><p>StackOverflowError&#44032; &#48156;&#49373;&#54616;&#51648; &#50506;&#51020;&#51012; &#54869;&#51064;&#54624; &#49688; &#51080;&#45796;. &#44208;&#47200;&#51201;&#51004;&#47196; &#47568;&#54616;&#47732;, &#51648;&#50669; &#54632;&#49688; &#44036;&#51032;
&#49345;&#54840; &#51116;&#44480; &#54840;&#52636;&#51032; &#44221;&#50864;&#50640;&#45716; letfn &#54632;&#49688;&#47484; &#51060;&#50857;&#54616;&#44256;, &#51204;&#50669; &#54632;&#49688; &#44036;&#51032; &#49345;&#54840; &#51116;&#44480; &#54840;&#52636;&#51008;
trampoline&#51012; &#51060;&#50857;&#54616;&#46972;&#45716; &#44163;&#51060;&#45796;. &#50500;&#50872;&#47084; &#46160; &#44221;&#50864; &#47784;&#46160; &#44844;&#47532; &#51116;&#44480; &#48169;&#49885;&#51004;&#47196; &#44396;&#54788;&#46104;&#48064;&#47196;
StackOverflowError&#44032; &#51068;&#50612;&#45216; &#44145;&#51221;&#51012; &#54616;&#51648; &#50506;&#50500;&#46020; &#46108;&#45796;.</p><h4>2.3<tt>&nbsp;</tt><a name="(part.__________)"></a>&#51116;&#44480; &#48169;&#49885;&#51032; &#48516;&#47448;</h4><h5>2.3.1<tt>&nbsp;</tt><a name="(part._.Accumulator_passing_style)"></a>Accumulator passing style</h5><p>&#51116;&#44480; &#54632;&#49688;&#51032; &#51064;&#51088;&#50640;, &#54632;&#49688;&#44032; &#44228;&#49328;&#54620; '&#44208;&#44284; &#44050;'&#51012; &#51204;&#45804;&#54616;&#45716; &#48169;&#49885;&#51060;&#45796;.</p><p><pre class="codeblock">(defn fact-aps
  ([n] (fact-aps n 1))
  ([n acc]
   (if (zero? n)
     acc
     (recur (dec n) (* n acc)))))

(fact-aps 10)
; =&gt; 120

(fact-aps 100000N)
; =&gt; 2824229407960347874293421578024535518477494926091224850578...</pre></p><h5>2.3.2<tt>&nbsp;</tt><a name="(part._.Continuation_passing_style)"></a>Continuation passing style</h5><p>&#51116;&#44480; &#54632;&#49688;&#51032; &#51064;&#51088;&#50640;, &#54632;&#49688; '&#44061;&#52404;(&#54632;&#49688; &#44061;&#52404; &#45236;&#48512;&#50640; &#49345;&#53468;&#47484; &#45236;&#51109;&#54620; &#49345;&#53468;&#47196;) &#51088;&#52404;'&#47484; &#51204;&#45804;&#54616;&#45716;
&#48169;&#49885;&#51004;&#47196; Scheme &#44057;&#51008; &#50616;&#50612;&#50640;&#49436; &#47566;&#51060; &#50416;&#51060;&#45716; &#48169;&#49885;&#51060;&#45796;.</p><p><pre class="codeblock">(defn fact-cps
  ([n] (fact-cps n identity))
  ([n cont]
   (if (zero? n)
     (cont 1)
     (recur (dec n) (fn [x] (cont (* n x)))))))

(fact-cps 10)
; =&gt; 120

(fact-cps 10000N)
; =&gt; java.lang.StackOverflowError</pre></p><p>&#44536;&#47088;&#45936; &#51060;&#49345;&#54616;&#44172;&#46020; StackOverflowError&#44032; &#48156;&#49373;&#54620;&#45796;. &#44536; &#51060;&#50976;&#47484; &#48516;&#49437;&#54644; &#48372;&#47732;</p><p><pre class="codeblock">(fact-cps 0)
; -&gt; (fact-cps 0 identity)
; -&gt; (identity 0)
; =&gt; 1

(fact-cps 1)
; -&gt; (fact-cps 1 identity)
; -&gt; (fact-cps 0 (fn [x] (identity (* 1 x))))
; -&gt; ((fn [x] (identity (* 1 x))) 1)
; =&gt; 1

(fact-cps 2)
; -&gt; (fact-cps 2 identity)
; -&gt; (fact-cps 1 (fn [x] (identity (* 2 x))))
; -&gt; (fact-cps 0 (fn [x] ((fn [x] (identity (* 2 x)))
;    		          (* 1 x))))
; -&gt; ((fn [x] ((fn [x] (identity (* 2 x)))   ; (1)
;      	       (* 1 x)))
;     1)
; =&gt; 2</pre></p><p>&#50948;&#51032; &#48516;&#49437; &#44284;&#51221;&#51012; &#53685;&#54644; &#45236;&#47536; &#44208;&#47200;&#51008;, fact-cps &#54632;&#49688;&#46020;, (1) &#51060;&#51204; &#44620;&#51648;&#45716; &#45796;&#47480; tail recursion
&#54632;&#49688;&#50752; &#47560;&#52268;&#44032;&#51648;&#47196; &#49828;&#53469;&#51012; &#49548;&#47784;&#54616;&#51648; &#50506;&#51648;&#47564;, &#47592; &#47560;&#51648;&#47561;&#50640; &#46020;&#45804;&#54644; &#44228;&#49328;&#51012; &#49892;&#51228;&#47196; &#49688;&#54665;&#54624; &#46412;,
&#51473;&#52393;&#46108; &#54632;&#49688;&#47484; &#49892;&#54665;&#54616;&#44172; &#46104;&#50612;&#49436; &#51060;&#46412; &#49828;&#53469;&#51012; &#47566;&#51060; &#49324;&#50857;&#54616;&#44172; &#46104;&#50612; StackOverflowError&#44032; &#48156;&#49373;&#54616;&#44172;
&#46108;&#45852;.</p><p>&#50948;&#51032; cps &#48169;&#49885;&#51032; &#44396;&#54788; &#50696;&#51228;&#46020; Scheme &#44057;&#51008; tail call optimization&#51012; &#51088;&#46041;&#51004;&#47196; &#51648;&#50896;&#54616;&#45716;
&#50616;&#50612;&#50640;&#49436;&#45716; &#49828;&#53469;&#50724;&#48260;&#54540;&#47196; &#50640;&#47084;&#44032; &#48156;&#49373;&#54616;&#51648; &#50506;&#45716;&#45796;. &#44536;&#47084;&#45936; JVM&#50640;&#49436;&#45716; tail call optimization&#51012;
&#51648;&#50896;&#54616;&#51648; &#50506;&#50500;&#49436; &#49828;&#53469;&#50724;&#48260;&#54540;&#47196; &#50640;&#47084;&#44032; &#48156;&#49373;&#54620; &#44163;&#51060;&#45796;. &#44536;&#47000;&#49436; &#53364;&#47196;&#51200;&#50640;&#49436; &#46021;&#51088;&#51201;&#51004;&#47196; &#51648;&#50896;&#54616;&#45716;
tail call optimization&#51012; &#49324;&#50857;&#54644;&#50556; &#54616;&#45716;&#45936;, &#47749;&#49884;&#51201;&#51004;&#47196; recur&#47484; &#54840;&#52636;&#54644; &#51452;&#50612;&#50556;&#47564; &#54620;&#45796;.</p><p>&#50500;&#47000;&#50640; trampoline &#54632;&#49688;&#47484; &#49324;&#50857;&#54644; factorial&#51012; &#44396;&#54616;&#45716; &#54632;&#49688;&#47484; &#51089;&#49457;&#54644; &#48372;&#50520;&#45796;.</p><p><pre class="codeblock">(defn fact-tramp
  ([n] (fact-tramp n 1))
  ([n acc]
   (if (zero? n)
     acc
     #(fact-tramp (dec n) (* n acc)))))

(trampoline fact-tramp 10)
; =&gt; 3628800

(trampoline fact-tramp 10000N)
; =&gt; 28462596809170545189064132......</pre></p><p>&#49828;&#53469;&#50724;&#48260;&#53364;&#47196; &#50640;&#47084;&#44032; &#48156;&#49373;&#54616;&#51648; &#50506;&#44256; &#51228;&#45824;&#47196; &#44208;&#44284;&#47484; &#48152;&#54872;&#54633;&#45768;&#46356;.</p><p>&#44536; &#51060;&#50976;&#44032; &#44417;&#44552;&#54644;&#49436; clojure.core&#51032; trampoline &#54632;&#49688; &#53076;&#46300;(&#48520;&#54596;&#50836;&#54620; &#48512;&#48516;&#51008; &#49373;&#47029;)&#47484;
&#49332;&#54196;&#48372;&#50520;&#49845;&#45768;&#45796;.</p><p><pre class="codeblock">(defn trampoline
  ([f]
     (let [ret (f)]   ; (1)
       (if (fn? ret)
         (recur ret)  ; (2)
         ret)))
  ([f &amp; args]
     (trampoline #(apply f args))))</pre></p><p>&#48708;&#44208;&#51008; (1) &#48512;&#48516;&#50640; &#51080;&#50632;&#45796;. &#54632;&#49688; &#50504;&#50640;&#49436; &#54632;&#49688;&#47484; &#54840;&#52636;&#54616;&#47732; &#49828;&#53469;&#50640; &#49939;&#50668; &#45208;&#44032;&#51648;&#47564;, &#54632;&#49688; &#54840;&#52636;&#51012;
'&#45149;&#45240; &#54980;', &#45796;&#49884; &#49352;&#47196;&#51060; &#47532;&#53556;&#48155;&#52772; &#54632;&#49688;(&#50668;&#44592;&#49436;&#45716; ret)&#47484; &#54840;&#52636;&#54616;&#45716; &#44592;&#48277;&#51012; &#50024;&#49436; &#49828;&#53469; &#49939;&#51060;&#45716; &#44163;&#51012;
&#54588;&#54644; &#45208;&#44032;&#45716; &#51208;&#47896;&#54620; &#44592;&#48277;&#51012; &#49324;&#50857;&#54616;&#44256; &#51080;&#45796;.</p><p>&#44536;&#47000;&#49436; &#45236;&#47536; &#44208;&#47200;&#51008;, trampoline&#46020; recur&#51032; &#51064;&#49688;&#47196; &#54632;&#49688;(&#54632;&#49688;&#44032; &#44228;&#49328;&#54620; '&#44208;&#44284;'&#44032; &#50500;&#45772;) &#51088;&#52404;&#47484;
&#45336;&#44200;&#51452;&#48064;&#47196; cps&#47196; &#48380; &#49688; &#51080;&#45796;&#45716; &#44163;&#51060;&#45796;. &#45796;&#47564;, fact-cps&#52376;&#47100; cps&#47484; &#51649;&#51217; &#44396;&#54788;&#54616;&#47732; &#49828;&#53469;&#50724;&#48260;&#54540;&#47196;
&#50640;&#47084;&#44032; &#48156;&#49373;&#54616;&#44592;&#50640;, &#51060;&#47484; &#54924;&#54588;&#54624; &#49688; &#51080;&#45716; &#48169;&#48277;&#51004;&#47196; trampoline&#47484; &#48324;&#46020;&#51032; &#54632;&#49688;&#47484; &#51228;&#44277;&#54616;&#44256; &#51080;&#45796;&#45716;
&#44163;&#51060;&#45796;.</p><div class="navsetbottom"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;</span><span class="navright">&nbsp;&nbsp;<a href="var.html" title="backward to &quot;1 Vars&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;Clojure Memo&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="doc-index.html" title="forward to &quot;Index&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div></div></div><div id="contextindicator">&nbsp;</div></body></html>