<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><title>1&nbsp;Why Clojure?</title><link rel="stylesheet" type="text/css" href="scribble.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-style.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-racket.css" title="default"/><script type="text/javascript" src="scribble-common.js"></script><script type="text/javascript" src="manual-racket.js"></script><!--[if IE 6]><style type="text/css">.SIEHidden { overflow: hidden; }</style><![endif]--></head><body id="scribble-racket-lang-org"><div class="tocset"><div class="tocview"><div class="tocviewlist tocviewlisttopspace"><div class="tocviewtitle"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_0&quot;);">&#9660;</a></td><td></td><td><a href="index.html" class="tocviewlink" data-pltdoc="x">Clojure Memo</a></td></tr></table></div><div class="tocviewsublisttop" style="display: block;" id="tocview_0"><table cellspacing="0" cellpadding="0"><tr><td align="right">1&nbsp;</td><td><a href="" class="tocviewselflink" data-pltdoc="x">Why Clojure?</a></td></tr><tr><td align="right">2&nbsp;</td><td><a href="var.html" class="tocviewlink" data-pltdoc="x">Vars</a></td></tr><tr><td align="right">3&nbsp;</td><td><a href="recursions.html" class="tocviewlink" data-pltdoc="x">Recursions</a></td></tr><tr><td align="right">4&nbsp;</td><td><a href="functional-programming.html" class="tocviewlink" data-pltdoc="x">Functional Programming</a></td></tr><tr><td align="right">5&nbsp;</td><td><a href="tips.html" class="tocviewlink" data-pltdoc="x">Tips</a></td></tr><tr><td align="right"></td><td><a href="doc-index.html" class="tocviewlink" data-pltdoc="x">Index</a></td></tr></table></div></div><div class="tocviewlist"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_1&quot;);">&#9658;</a></td><td>1&nbsp;</td><td><a href="" class="tocviewselflink" data-pltdoc="x">Why Clojure?</a></td></tr></table><div class="tocviewsublistbottom" style="display: none;" id="tocview_1"><table cellspacing="0" cellpadding="0"><tr><td align="right">1.1&nbsp;</td><td><a href="#%28part._.Clojure____.O.O.P______%29" class="tocviewlink" data-pltdoc="x">Clojure&#45716; &#50780; OOP&#44032; &#50500;&#45772;&#44032;?</a></td></tr><tr><td align="right">1.2&nbsp;</td><td><a href="#%28part._.Common_.Lisp___________%29" class="tocviewlink" data-pltdoc="x">Common Lisp&#51008; &#54632;&#49688;&#54805; &#50616;&#50612;&#51064;&#44032;?</a></td></tr><tr><td align="right">1.3&nbsp;</td><td><a href="#%28part.______.Clojure______________%29" class="tocviewlink" data-pltdoc="x">&#45208;&#45716; &#50780; Clojure&#47484; &#51452;&#47141; &#50616;&#50612;&#47196; &#49440;&#53469;&#54664;&#45208;?</a></td></tr><tr><td align="right">1.4&nbsp;</td><td><a href="#%28part._.Clojure__________%29" class="tocviewlink" data-pltdoc="x">Clojure&#45716; &#50620;&#47560;&#45208; &#48736;&#47480;&#44032;?</a></td></tr></table></div></div></div><div class="tocsub"><div class="tocsubtitle">On this page:</div><table class="tocsublist" cellspacing="0"><tr><td><span class="tocsublinknumber">1.1<tt>&nbsp;</tt></span><a href="#%28part._.Clojure____.O.O.P______%29" class="tocsubseclink" data-pltdoc="x">Clojure&#45716; &#50780; OOP&#44032; &#50500;&#45772;&#44032;?</a></td></tr><tr><td><span class="tocsublinknumber">1.2<tt>&nbsp;</tt></span><a href="#%28part._.Common_.Lisp___________%29" class="tocsubseclink" data-pltdoc="x">Common Lisp&#51008; &#54632;&#49688;&#54805; &#50616;&#50612;&#51064;&#44032;?</a></td></tr><tr><td><span class="tocsublinknumber">1.3<tt>&nbsp;</tt></span><a href="#%28part.______.Clojure______________%29" class="tocsubseclink" data-pltdoc="x">&#45208;&#45716; &#50780; Clojure&#47484; &#51452;&#47141; &#50616;&#50612;&#47196; &#49440;&#53469;&#54664;&#45208;?</a></td></tr><tr><td><span class="tocsublinknumber">1.4<tt>&nbsp;</tt></span><a href="#%28part._.Clojure__________%29" class="tocsubseclink" data-pltdoc="x">Clojure&#45716; &#50620;&#47560;&#45208; &#48736;&#47480;&#44032;?</a></td></tr></table></div></div><div class="maincolumn"><div class="main"><div class="versionbox"><span class="version">6.2</span></div><div class="navsettop"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;</span><span class="navright">&nbsp;&nbsp;<a href="index.html" title="backward to &quot;Clojure Memo&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;Clojure Memo&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="var.html" title="forward to &quot;2 Vars&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div><h3>1<tt>&nbsp;</tt><a name="(part._why-clojure)"></a>Why Clojure?</h3><h4>1.1<tt>&nbsp;</tt><a name="(part._.Clojure____.O.O.P______)"></a>Clojure&#45716; &#50780; OOP&#44032; &#50500;&#45772;&#44032;?</h4><p>&#45236;&#44032; &#48372;&#44592;&#50640; Clojure&#51032; &#52285;&#49884;&#51088;&#51064; Rich Hickey&#45716;, &#54532;&#47196;&#44536;&#47000;&#48141;&#51032; &#48376;&#51656;&#51201;&#51064; &#47928;&#51228;(&#48373;&#51105;&#49457;&#50640; &#45824;&#54620;
&#54644;&#44208;)&#50640; &#45824;&#54620; &#54644;&#48277;&#51012; Clojure&#46972;&#45716; &#50616;&#50612;&#47484; &#53685;&#54644; &#51228;&#49884;&#54664;&#45796;&#45716; &#51216;&#50640;&#49436;, &#54532;&#47196;&#44536;&#47000;&#47672;&#44032; &#50500;&#45768;&#46972;
&#52384;&#54617;&#51088;&#51060;&#45796;. &#51652;&#51221;&#54620; &#52384;&#54617;&#51088;&#45716; &#49884;&#45824;&#51032; '&#48376;&#51656;&#51201; &#47928;&#51228;'&#51012; &#51221;&#54869;&#55176; &#51069;&#44256; &#44536; &#54644;&#48277;&#51012; &#51228;&#49884;&#54620;&#45796;&#45716; &#54620;&#45796;&#45716;
&#51216;&#50640;&#49436;, &#50976;&#49324;&#51216;&#51060; &#51080;&#44592; &#46412;&#47928;&#51060;&#45796;. &#50724;&#45720;&#45216; &#49548;&#54532;&#53944;&#50920;&#50612; &#50629;&#44228;&#44032; &#45817;&#47732;&#54620; &#47928;&#51228;&#46308;&#51032; &#45824;&#48512;&#48516;&#51008; &#51452;&#47196;
&#54532;&#47196;&#44536;&#47016;&#51032; &#44396;&#51312;&#44032; &#48373;&#51105;&#54616;&#45796;&#45716; &#45936;&#49436; &#44592;&#51064;&#54620;&#45796;. &#44536;&#47088;&#45936; &#51060; &#48373;&#51105;&#49457;&#51008; &#54596;&#50672;&#51201;(&#48376;&#51656;&#51201;)&#51064; &#48373;&#51105;&#49457;&#44284;
&#50864;&#50672;&#51201;&#51064;(&#48520;&#54596;&#50836;&#54620;) &#48373;&#51105;&#49457;&#51004;&#47196; &#45208;&#45572;&#50612; &#48380; &#49688; &#51080;&#45716;&#45936;, Clojure &#50616;&#50612; &#49444;&#44228;&#51032; &#44032;&#51109; &#51473;&#50836;&#54620; &#52384;&#54617;&#51008;
&#48148;&#47196; &#51060; &#48520;&#54596;&#50836;&#54620; &#48373;&#51105;&#49457;&#51012; &#52572;&#45824;&#54620; &#51228;&#44144;&#54616;&#45716; &#45936; &#51080;&#45796;.  &#44536;&#47088; &#51216;&#50640;&#49436;, Clojure&#45716; &#45800;&#49692;&#55176; &#46608; &#45796;&#47480;
Lisp &#51060;&#46972;&#44592; &#48372;&#45796;&#45716;, Lisp&#51032; &#44053;&#51216;&#44284; Functional Language&#51032; &#44053;&#51216;&#51012; &#44208;&#54633;&#54620;, Thomas Kuhn&#51060; &lt;&#44284;&#54617;
&#54785;&#47749;&#51032; &#44396;&#51312;&gt;&#46972;&#45716; &#52293;&#50640;&#49436; &#50616;&#44553;&#54620; &#44163;&#44284; &#44057;&#51008;, '&#49352;&#47196;&#50868; &#54056;&#47084;&#45796;&#51076;(&#52264;&#50896;)'&#51032; Lisp&#51060;&#45796;.</p><p>&#54532;&#47196;&#44536;&#47016;&#51032; &#44396;&#51312;&#44032; '&#48373;&#51105;'&#54644;&#49436; &#44060;&#48156; &#44592;&#44036;&#51060; &#45720;&#50612;&#45208;&#44256;, &#44536;&#50640; &#46384;&#46972; &#44060;&#48156; &#51064;&#47141;&#44284; &#44060;&#48156; &#48708;&#50857;&#46020;
&#45720;&#50612;&#45212;&#45796;. &#45817;&#50672;&#55176; &#50976;&#51648;/&#48372;&#49688;&#46020; &#55192;&#46308;&#50612;&#51652;&#45796;. &#47928;&#51228;&#45716; &#54788; &#49548;&#54532;&#53944;&#50920;&#50612; &#50629;&#44228;&#44032; &#51060; &#48373;&#51105;&#49457;&#51012; '&#45817;&#50672;&#54620;
&#44163;'&#51004;&#47196; &#48155;&#50500;&#46308;&#51060;&#44256; &#51080;&#45796;&#45716; &#45936; &#45908; &#53360; &#47928;&#51228;&#44032; &#51080;&#45716; &#44163; &#44057;&#45796;. &#47928;&#51228;&#47484; &#47928;&#51228;&#47196; &#51064;&#49885;&#54616;&#51648; &#47803;&#54616;&#45716; &#44163;,
&#51060;&#44163;&#51060; &#48148;&#47196; &#44032;&#51109; &#53360; &#47928;&#51228;&#51060;&#45796;. &#50696;&#47484; &#46308;&#50612;, &#50612;&#46500; &#49324;&#46988;&#51008; &#45208;&#45716; &#46356;&#51088;&#51064; &#54056;&#53556;&#51012; 20&#44060; &#51060;&#49345; &#50508;&#44256;
&#51080;&#45796;&#44256; &#51088;&#46993;&#54620;&#45796;. &#44536;&#47088;&#45936; &#44536; &#46356;&#51088;&#51064; &#54056;&#53556;&#51060;&#46972;&#45716; &#44163;&#51060;, &#53364;&#47000;&#49828;&#46972;&#45716; &#44060;&#45392; &#51088;&#52404;&#44032; &#50630;&#51004;&#47732;, &#50500;&#50696;
&#54596;&#50836;&#51312;&#52264; &#54616;&#51648; &#50506;&#45716; &#44163;&#46308;&#51060;&#45796;. &#46356;&#51088;&#51064; &#54056;&#53556;&#51032; &#51221;&#54869;&#54620; &#51032;&#48120;&#44032; '&#53364;&#47000;&#49828; &#46356;&#51088;&#51064; &#54056;&#53556;' &#50500;&#45772;&#44032;?
&#45208;&#50640;&#44172;&#45716; &#53364;&#47000;&#49828;&#51032; &#46020;&#51077;&#51004;&#47196; &#50556;&#44592;&#46108; &#50864;&#50672;&#51201; &#48373;&#51105;&#49457;&#51012;, &#45908; &#48373;&#51105;&#54620; &#54805;&#53468;&#47196; &#44537;&#48373;&#54616;&#47140;&#45716; &#49884;&#46020;&#47196; &#48372;&#51068;
&#49104;&#51060;&#45796;.</p><p>&#45236;&#44032; &#44061;&#52404; &#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;(Object-Oriented Programming)&#51060; &#47924;&#51312;&#44148; &#45208;&#49240;&#45796;&#45716; &#52712;&#51648;&#47196; &#51060;&#50556;&#44592;&#54616;&#45716;
&#44163;&#51008; &#47932;&#47200; &#50500;&#45768;&#45796;. &#44061;&#52404; &#51648;&#54693; &#48169;&#49885;&#51060; &#50976;&#50857;&#54620; &#48516;&#50556;&#45716; &#45817;&#50672;&#55176; &#51080;&#51012; &#44163;&#51060;&#45796;. &#45800;&#51648; &#44536;&#44163;&#51060;
&#54532;&#47196;&#44536;&#47000;&#48141;&#51032; &#47784;&#46304; &#44163;&#51064; &#50577; &#50668;&#44592;&#44256;, &#47784;&#46304; &#47928;&#51228;&#47484; &#44061;&#52404; &#51648;&#54693; &#48169;&#49885;&#51004;&#47196; &#52376;&#47532;&#54616;&#47140;&#44256;&#47564; &#54624;&#49104;, &#45908;
&#45208;&#51008; &#48169;&#49885;&#51032; &#54644;&#44208;&#52293;&#51012; &#52628;&#44396;&#54616;&#51648; &#50506;&#51004;&#47140;&#45716; &#51088;&#49464;&#47484; &#51648;&#51201;&#54616;&#44256; &#51080;&#45716; &#44163;&#51060;&#45796;.</p><p>&#45208;&#45716; &#48520;&#48320; &#45936;&#51060;&#53552;&#51032; &#44053;&#51216;&#51008;, &#48520;&#48320; &#45936;&#51060;&#53552;&#51032; &#46020;&#51077;&#51004;&#47196; &#54532;&#47196;&#44536;&#47000;&#48141;&#51060; &#45800;&#49692;&#54868;&#46104;&#50632;&#45796;&#45716; &#51216;&#50640;&#49436; &#52286;&#44256;
&#51080;&#45796;. &#46356;&#48260;&#44613; &#45800;&#50948;&#44032; &#54632;&#49688; &#54616;&#45208;&#47196; &#44397;&#54620;&#46104;&#45768;, &#47928;&#51228;&#51032; &#50896;&#51064;&#51012; &#54632;&#49688; &#54616;&#45208;&#51032; &#45236;&#48512;&#50640;&#49436; &#52286;&#50500;&#49436;
&#52376;&#47532;&#54616;&#47732; &#44536;&#44163;&#51004;&#47196; &#45149;&#51060;&#45796;. &#44061;&#52404; &#51648;&#54693;&#51032; &#44221;&#50864;&#50640;&#45716; &#53364;&#47000;&#49828; &#51204;&#52404;&#47484; &#50684;&#46160;&#50640; &#46160;&#50612;&#50556; &#54616;&#51648; &#50506;&#45716;&#44032;?
&#44172;&#45796;&#44032; &#49345;&#49549;&#51060; &#51080;&#45716; &#44221;&#50864;, &#49345;&#50948; &#53364;&#47000;&#49828;&#51032; &#49548;&#49828; &#53076;&#46300;&#44620;&#51648; &#51060;&#54644;&#54644;&#50556; &#54616;&#45716;&#45936;, &#51060; &#47784;&#46304; &#44163;&#51060; &#44032;&#48320;
&#45936;&#51060;&#53552;(&#47716;&#48260; &#48320;&#49688;)&#51032; &#49345;&#53468;&#47484; &#51060; &#47700;&#49436;&#46300;, &#51200; &#47700;&#49436;&#46300;&#44032; &#44148;&#46300;&#47140;&#49436; &#49373;&#44592;&#45716; &#47928;&#51228;&#51060;&#45796;. &#54532;&#47196;&#44536;&#47000;&#48141;
&#45800;&#50948;&#44032; &#54632;&#49688; &#54616;&#45208;&#47564;&#51004;&#47196; &#51329;&#54784;&#51648;&#45716; &#44163; &#51088;&#52404;&#44032; &#54532;&#47196;&#44536;&#47000;&#48141;&#51032; &#48373;&#51105;&#49457;&#51012; &#51228;&#44144;&#54644; &#51456;&#45796;&#44256; &#48372;&#44256; &#51080;&#44592;
&#46412;&#47928;&#50640;, &#45208;&#45716; &#54632;&#49688;&#54805; &#50616;&#50612;&#47484;, &#53945;&#55176; &#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#51064; Clojure&#47484; &#45458;&#44172; &#54217;&#44032;&#54620;&#45796;.</p><p>&#50696;&#47484; &#46308;&#50612;, &#46041;&#51068;&#54620; &#51068;&#51012; &#49688;&#54665;&#54616;&#45716;&#45936;, Python&#44284; Clojure&#47196; &#51089;&#49457;&#54664;&#45796;&#44256; &#44032;&#51221;&#54644; &#48372;&#51088;. &#44277;&#44368;&#47213;&#44172;&#46020;
&#46972;&#51064; &#49688;&#46020; &#44144;&#51032; &#44057;&#45796;. &#44536;&#47084;&#47732; &#51060; &#46160; &#54532;&#47196;&#44536;&#47016;&#51008; &#46321;&#44032;&#51064;&#44032;? &#45208;&#45716; &#44536;&#47111;&#51648; &#50506;&#45796;&#44256; &#48376;&#45796;. &#54028;&#51060;&#50028;&#51008;
&#44061;&#52404; &#51648;&#54693; &#50616;&#50612;&#51060;&#50612;&#49436;, &#54532;&#47196;&#44536;&#47000;&#48141; &#45800;&#50948;&#44032; &#53364;&#47000;&#49828;&#51068; &#49688;&#48150;&#50640; &#50630;&#45796;&#45716; &#51216;&#50640;&#49436;, &#54532;&#47196;&#44536;&#47000;&#48141; &#45800;&#50948;&#44032;
&#54632;&#49688; &#45800;&#50948;&#51064; &#53364;&#47196;&#51200; &#53076;&#46300;&#50640; &#48708;&#54644;&#49436; &#48373;&#51105;&#49457;&#51008; &#55016;&#50476; &#53360; &#44163;&#51060;&#45796;. &#48373;&#51105;&#49457;&#51060;&#46972;&#45716; &#44592;&#51456;&#50640;&#49436; &#48380; &#46412;&#45716; &#53360;
&#52264;&#51060;&#44032; &#51080;&#45716; &#44163;&#51060;&#44256;, &#50500;&#47560;&#46020; &#53364;&#47000;&#49828;&#51032; &#53356;&#44592;&#44032; &#45720;&#50612;&#45216; &#49688;&#47197; &#44536; &#48373;&#51105;&#49457;&#51008; &#44592;&#54616;&#44553;&#49688;&#51201;&#51004;&#47196; &#45720;&#50612;&#45216;
&#49688; &#51080;&#45796;&#45716; &#51216;&#50640;&#49436;, Clojure&#47196; &#51089;&#49457;&#46108; &#53076;&#46300;&#44032; &#45908; &#50864;&#50900;&#54616;&#45796;&#44256; &#45208;&#45716; &#54032;&#45800;&#54620;&#45796;.</p><p>&#45208;&#46020; &#52376;&#51020;&#50644; &#48520;&#48320; &#45936;&#51060;&#53552;&#47484; &#45796;&#47336;&#45716; &#44163;&#51060; &#47588;&#50864; &#51676;&#51613;&#49828;&#47084;&#50912;&#45796;. &#44536;&#45285; &#44050;&#51012; &#48148;&#44984;&#47732; &#49789;&#44172; &#54644;&#44208;&#46112; &#51068;&#51012;
&#51068;&#48512;&#47084; &#50612;&#47157;&#44172; &#52376;&#47532;&#54616;&#44256; &#51080;&#45716;&#44172; &#50500;&#45772;&#44032; &#54616;&#45716; &#51032;&#44396;&#49900;&#51060; &#47566;&#51060; &#46308;&#50632;&#45912; &#44163;&#46020; &#49324;&#49892;&#51060;&#50632;&#51648;&#47564;, &#50836;&#51608;&#50640;&#45716;
&#44144;&#44984;&#47196; mutable &#45936;&#51060;&#53552;&#47196; &#47928;&#51228;&#47204; &#54644;&#44208;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864;&#50640;&#46020;, &#51060;&#44163;&#51012; &#48520;&#48320; &#45936;&#51060;&#53552;&#47196; &#52376;&#47532;&#54624; &#49688;&#45716;
&#50630;&#51012;&#44620; &#44256;&#48124;&#54616;&#44172; &#46048;&#45716; &#51221;&#46020;&#47196; &#48148;&#45068;&#50632;&#45796;. &#44208;&#44397;&#51008; &#51061;&#49689;&#54644;&#51648;&#44592;&#44620;&#51648; &#49884;&#44036;&#51060; &#44152;&#47540; &#49688;&#48150;&#50640; &#50630;&#45716; &#47928;&#51228;&#51064;
&#44163; &#44057;&#45796;. &#44403;&#51060; &#50780; &#51060;&#47111;&#44172; &#54616;&#45712;&#45264;&#44256; &#48152;&#47928;&#54624; &#49688;&#46020; &#51080;&#44192;&#51648;&#47564;, &#44536;&#47111;&#44172; &#54616;&#45716; &#44163;&#51060; &#54532;&#47196;&#44536;&#47016;&#51032;
&#48373;&#51105;&#46020;&#47484; &#51460;&#50668;, &#44208;&#44284;&#51201;&#51004;&#47196; &#44060;&#48156; &#44592;&#44036;&#51032; &#45800;&#52629;&#51060;&#45208; &#50976;&#51648;/&#48372;&#49688;&#51032; &#49688;&#50900;&#54632;&#51060;&#46972;&#45716; &#51060;&#51061;&#51004;&#47196; &#45796;&#44032;&#50724;&#44592;
&#46412;&#47928;&#51060;&#45796;. &#54620; &#47560;&#46356;&#47196; &#47568;&#54616;&#51088;&#47732; &#44536;&#44163;&#51060; &#44417;&#44537;&#51201;&#51004;&#47196; '&#49373;&#49328;&#49457;'&#51012; &#45458;&#50668;&#51452;&#44592; &#46412;&#47928;&#51060;&#51648;, &#45796;&#47480; &#51060;&#50976;&#45716;
&#50630;&#45796;.</p><p>&#44208;&#47200;&#51201;&#51004;&#47196;, Clojure&#51032; &#51109;&#51216;&#51008; 'Lisp macro + immutable data + JVM Library'&#47484; &#47784;&#46160; &#51060;&#50857;&#54624; &#49688;
&#51080;&#45796;. &#44172;&#45796;&#44032; Clojure&#45716; STM(Software Transaction Memory)&#51060; &#44396;&#54788;&#46104;&#50612; &#51080;&#50612;&#49436;, Thread &#44288;&#47532;&#47484;
&#51088;&#46041;&#51004;&#47196; &#54644; &#51456;&#45796;&#45716; &#51216;&#46020; &#47924;&#49884;&#54624;&#49688; &#50630;&#45716; &#44053;&#51216;&#51060;&#45796;. Clojure &#54532;&#47196;&#44536;&#47000;&#47672;&#46308;&#51008; Thread &#44288;&#47532;&#47484; &#51649;&#51217;
&#54616;&#51648; &#50506;&#45716;&#45796;. &#51060;&#44148; &#47560;&#52824; Garbage Collection&#51012; &#50616;&#50612; &#51088;&#52404;&#44032; &#45824;&#49888; &#52376;&#47532;&#54644; &#51468;&#51004;&#47196;&#50024;, &#54532;&#47196;&#44536;&#47000;&#47672;&#44032;
&#47700;&#47784;&#47532;&#47484; &#51649;&#51217; &#44288;&#47532;&#54644;&#50556; &#54616;&#45716; &#48512;&#45812;&#51004;&#47196;&#48512;&#53552; &#54644;&#48169;&#46104;&#50632;&#46319;&#51060;, Multi Threads &#44288;&#47144; &#52376;&#47532;&#47484; &#50616;&#50612;&#44032;
&#45824;&#49888;&#54644; &#51468;&#51004;&#47196;&#50024;, &#54532;&#47196;&#44536;&#47000;&#47672;&#44032; &#51649;&#51217; &#50416;&#47112;&#46300;&#47484; &#44288;&#47532;&#54644;&#50556; &#54616;&#45716; &#48512;&#45812;&#51004;&#47196;&#48512;&#53552; &#54644;&#48169;&#46108; &#44163;&#51004;&#47196;
&#51060;&#54644;&#54616;&#47732; &#46108;&#45796;.</p><h4>1.2<tt>&nbsp;</tt><a name="(part._.Common_.Lisp___________)"></a>Common Lisp&#51008; &#54632;&#49688;&#54805; &#50616;&#50612;&#51064;&#44032;?</h4><p>Clojure&#45716; &#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#51060;&#44592;&#46020; &#54616;&#45796;. &#44536;&#47000;&#49436; &#47532;&#49845; &#50616;&#50612;&#51032; &#50896;&#51312;&#46972; &#54624; &#49688; &#51080;&#45716; Common Lisp&#44284;&#51032;
&#48708;&#44368;&#47484; &#53685;&#54644; '&#54632;&#49688;&#54805; &#54532;&#47196;&#44536;&#47000;&#48141;&#51060;&#46976; &#47924;&#50631;&#51064;&#44032;'&#50640; &#45824;&#54620; &#51060;&#50556;&#44592;&#47484; &#54400;&#50612; &#45208;&#44032;&#44192;&#45796;. &#47566;&#51008; &#49324;&#46988;&#46308;&#51060;
Common Lisp&#51012; &#54632;&#49688;&#54805; &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612;&#47196; &#50508;&#44256; &#51080;&#45716; &#44163; &#44057;&#45796;. &#51060;&#47088; &#44204;&#54644;&#45716; &#54632;&#49688;&#54805; &#50616;&#50612;&#47484; &#50612;&#46523;&#44172;
&#51221;&#51032;&#54616;&#45712;&#45264;&#50640; &#46384;&#46972;, &#47582;&#45716; &#44204;&#54644;&#51068; &#49688;&#46020; &#51080;&#44256;, &#48512;&#51201;&#51208;&#54620; &#54364;&#54788;&#51068; &#49688;&#46020; &#51080;&#45796;.</p><p>&#47676;&#51200; &#54632;&#49688;&#54805; &#50616;&#50612;&#47484; '&#45331;&#51008;' &#51032;&#48120;&#50640;&#49436; &#51221;&#51032;&#54616;&#47732;, Common Lisp&#51008; &#54632;&#49688;&#54805; &#50616;&#50612;&#51032; &#51312;&#44148;&#51012; &#45796; &#44054;&#52628;&#44256;
&#51080;&#45796;.</p><p>&#45796;&#51020;&#51032; &#51312;&#44148; 4 &#44032;&#51648;&#47484; &#52649;&#51313;&#49884;&#53412;&#47732;, &#44536; &#54632;&#49688;&#45716; &#51068;&#44553; &#54632;&#49688;(fisrt-class function)&#46972;&#44256; &#48512;&#47476;&#44256;,
&#51068;&#44553; &#54632;&#49688;&#47484; &#51648;&#50896;&#54616;&#45716; &#50616;&#50612;&#45716;, '&#51204;&#53685;&#51201;&#51064; &#51032;&#48120;'&#50640;&#49436;&#51032; &#54632;&#49688;&#54805; &#50616;&#50612;&#46972;&#44256; &#48512;&#47484; &#49688; &#51080;&#45796;.</p><ol><li><p>&#54632;&#49688; &#44061;&#52404;&#47484; &#48320;&#49688;&#50640; &#45824;&#51077;&#54624; &#49688; &#51080;&#45796;.
<pre class="codeblock">(def my-add (fn [a b]
              (+ a b)))

(my-add 10 20)    ; =&gt; 30

(def my-add2 my-add)

(my-add2 30 40)   ; =&gt; 70</pre></p></li><li><p>&#54632;&#49688; &#44061;&#52404;&#47484; &#54632;&#49688;&#51032; &#51064;&#49688;&#47196; &#51204;&#45804;&#54624; &#49688; &#51080;&#45796;.
<pre class="codeblock">(defn calc [op a b]
  (op a b))

(calc + 10 20)   ; =&gt; 30
(calc * 10 20)   ; =&gt; 200</pre></p></li><li><p>&#54632;&#49688; &#44061;&#52404;&#47484; &#54632;&#49688;&#51032; &#48152;&#54872;&#44050;&#51004;&#47196; &#48152;&#54872;&#54624; &#49688; &#51080;&#45796;.
<pre class="codeblock">(defn operator [op]
  (if (= op :plus)
    +
    -))

((operator :plus) 10 20)    ; =&gt; 30
((operator :minus) 10 20)   ; =&gt; -10</pre></p></li><li><p>&#54632;&#49688; &#44061;&#52404;&#47484; &#46041;&#51201;&#51004;&#47196; &#49373;&#49457;&#54624; &#49688; &#51080;&#45796;.
<pre class="codeblock">(defn add-n [n]
  (fn [a]
    (+ a n)))

(def add-5 (add-n 5))
; =&gt; #&lt;Var@4340684b: #object[user$add_n$fn__12286 0x26a894a2]&gt;

(def add-10 (add-n 10))
; =&gt; #&lt;Var@fc4d31e: #object[user$add_n$fn__12286 0x1a4b7c5d]&gt;

(add-5 10)    ; =&gt; 15
(add-10 10)   ; =&gt; 20</pre></p></li></ol><ul><li><p>&#52840;&#44256;: &#53945;&#55176; &#50948;&#51032; &#46160; &#48264;&#51704;&#50752; &#49464; &#48264;&#51704; &#51312;&#44148;&#51012; &#52649;&#51313;&#49884;&#53412;&#45716; &#54632;&#49688;&#47484; &#44256;&#52264; &#54632;&#49688;(higher-order
function)&#46972;&#44256; &#48512;&#47480;&#45796;.</p></li></ul><p>Common Lisp&#51008; &#50948;&#51032; &#45348; &#44032;&#51648; &#51312;&#44148; &#47784;&#46160;&#47484; &#47564;&#51313;&#49884;&#53416; &#52572;&#52488;&#51032; &#50616;&#50612;&#51060;&#45796;. &#44536;&#47088;&#45936; &#47928;&#51228;&#45716; &#50836;&#51608; &#49352;&#47196;
&#46321;&#51109;&#54616;&#45716; &#50616;&#50612;&#46308; &#44144;&#51032; &#45824;&#48512;&#48516;&#51060; &#50948;&#51032; &#45348; &#51312;&#44148;&#51012; &#47784;&#46160; &#52649;&#51313;&#49884;&#53412;&#44256; &#51080;&#45796;&#45716; &#44163;&#51060;&#45796;(&#44208;&#47200;&#51201;&#51004;&#47196;,
&#47532;&#49845;&#51012; &#55113;&#45236;&#45236;&#44256; &#51080;&#45796;&#44256; &#48400;&#46020; &#47924;&#48169;&#54616;&#45796;). JavaScript&#47560;&#51200;&#46020; &#50948;&#51032; &#45348; &#51312;&#44148;&#51012; &#47784;&#46160; &#52649;&#51313;&#49884;&#53412;&#44256;
&#51080;&#45716;&#45936;, &#44536;&#47111;&#45796;&#47732; JavaScript&#46020; &#54632;&#49688;&#54805; &#50616;&#50612;&#46972;&#44256; &#48520;&#47084;&#50556; &#54620;&#45796;.</p><p>&#44536;&#47084;&#47732; &#51648;&#44552;&#48512;&#53552;&#45716; &#50836;&#51608; &#44033;&#44305;&#48155;&#44592; &#49884;&#51089;&#54616;&#44256; &#51080;&#45716; '&#50628;&#44201;&#54620;' &#51032;&#48120;&#50640;&#49436;&#51032; &#54632;&#49688;&#54805; &#50616;&#50612;&#50640; &#45824;&#54644; &#47568;&#54644;
&#48372;&#44192;&#45796;. &#44061;&#52404;&#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;&#51060; &#44054;&#45716; &#47928;&#51228;&#51216;&#51012; &#44537;&#48373;&#54616;&#44256;&#51088; &#54616;&#45716; &#45824;&#50504;&#51004;&#47196;&#49436; &#50836;&#51608; &#51452;&#47785;&#48155;&#44256; &#51080;&#45716;
'&#54632;&#49688;&#54805; &#50616;&#50612;'&#45716; &#50948;&#51032; 4&#44032;&#51648; &#51312;&#44148;&#50640; &#45908;&#54644;&#49436;, immutable &#51088;&#47308;&#54805;&#51012; &#44592;&#48376;(default)&#51004;&#47196; &#51228;&#44277;&#54644;&#50556;
&#54620;&#45796;. &#51060; &#51312;&#44148;&#51012; &#54616;&#45208; &#45908; &#52649;&#51313;&#49884;&#53020;&#50556;, &#50836;&#51608;&#50640; &#47568;&#54616;&#45716;, &#51652;&#51221;&#54620; &#51032;&#48120;&#51032; &#54632;&#49688;&#54805; &#50616;&#50612;&#46972;&#44256; &#47568;&#54624; &#49688;
&#51080;&#45796;. Clojure&#46020; &#51060; &#48276;&#51452;&#50640; &#49549;&#54616;&#45716; &#54632;&#49688;&#54805; &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612;&#51060;&#45796;. immutable &#51088;&#47308;&#54805;&#51012; &#44592;&#48376;&#51004;&#47196;
&#54616;&#47732;, &#47700;&#47784;&#47532; &#49548;&#50836;&#47049;&#46020; &#47566;&#50500;&#51648;&#44256; &#52376;&#47532; &#49884;&#44036;&#46020; &#44600;&#50612;&#51648;&#45716;&#45936;, &#50780; &#44403;&#51060; immutable &#51088;&#47308;&#54805;&#51012; &#44592;&#48376;&#51004;&#47196;
&#54624;&#44620;? &#44536;&#44163;&#51008; immutable &#51088;&#47308;&#54805;&#51012; &#44592;&#48152;&#51004;&#47196; &#50672;&#49328;&#51012; &#49688;&#54665;&#54616;&#47732;, &#54532;&#47196;&#44536;&#47016;&#51032; &#48373;&#51105;&#46020;&#44032; &#50628;&#52397;&#45208;&#44172;
&#51460;&#50612;&#46308;&#44592; &#46412;&#47928;&#51060;&#45796;.</p><p>&#44284;&#44144;&#50640; &#51208;&#52264;&#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;&#51032; &#47928;&#51228;&#51216;&#51012; &#44537;&#48373;&#54624; &#49688; &#51080;&#45716; &#45824;&#50504;&#51004;&#47196; &#44061;&#52404;&#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;&#51060; &#46321;&#51109;&#54620;
&#51060;&#50976;&#44032; &#47924;&#50631;&#51060;&#50632;&#45208;? &#51204;&#50669; &#48320;&#49688;&#51032; &#49324;&#50857;&#51012; &#51460;&#51060;&#44256;, &#48320;&#49688;&#47484; &#53364;&#47000;&#49828; &#50504;&#50640; &#44032;&#46160;&#50612; &#45459;&#51008; &#54980;&#50640;, &#53364;&#47000;&#49828;
&#45236;&#51032; &#47716;&#48260; &#48320;&#49688;&#47564; &#51217;&#44540; &#44032;&#45733;&#54616;&#46020;&#47197; '&#44053;&#51228;'&#54620; &#51060;&#50976;&#44032; &#47924;&#50631;&#51068;&#44620;? &#44536; &#51060;&#50976;&#45716;, &#51204;&#50669; &#48320;&#49688;&#51032; &#44221;&#50864;&#50640;&#45716;
&#54532;&#47196;&#44536;&#47000;&#48141; &#45236;&#51032; &#50612;&#46500; &#54632;&#49688;&#50640;&#49436;&#46020; &#51217;&#44540;&#51060; &#44032;&#45733;&#54644;&#49436;, &#44536;&#50640; &#46384;&#46972; &#50612;&#46500; &#54632;&#49688;&#44032; &#44536; &#48320;&#49688;&#47484;
&#44148;&#46300;&#47160;&#45716;&#51648; &#52628;&#51201;&#54616;&#44592; &#47924;&#51648;&#47924;&#51648; &#50612;&#47157;&#44592; &#46412;&#47928;&#51060;&#51648; &#50506;&#50520;&#45912;&#44032;? &#47932;&#47200; &#51204;&#50669; &#48320;&#49688;&#47484; &#47566;&#51060; &#49324;&#50857;&#54644;&#49436;
&#54532;&#47196;&#44536;&#47000;&#48141;&#54620;&#45796; &#54644;&#46020;, &#54532;&#47196;&#44536;&#47000;&#47672;&#44032; &#50500;&#51452; &#50500;&#51452; &#51312;&#49900;&#49828;&#47101;&#44256; &#49464;&#49900;&#54616;&#44172; &#54532;&#47196;&#44536;&#47000;&#48141;&#54616;&#47732; &#44536;
&#54532;&#47196;&#44536;&#47016;&#51008; &#51096; &#46028;&#50500;&#44040; &#49688; &#51080;&#51012; &#44163;&#51060;&#45796;. &#54616;&#51648;&#47564; &#44536;&#47111;&#44172; &#49464;&#49900;&#54616;&#44256; &#44860;&#44860;&#54620; &#54532;&#47196;&#44536;&#47000;&#47672;&#46020;, &#51088;&#49888;&#51060; &#51680;
&#54532;&#47196;&#44536;&#47000;&#48141; &#49548;&#49828; &#53076;&#46300;&#47484; 2&#44060;&#50900; &#51221;&#46020; &#51648;&#45208; &#46308;&#50668;&#45796; &#48400;&#46020; &#51088;&#49888;&#51060; &#51680; &#53076;&#46300;&#47484; &#51096; &#51060;&#54644;&#54616;&#51648; &#47803;&#54616;&#45716;&#45936;,
&#54616;&#47932;&#47728; &#45796;&#47480; &#49324;&#46988;&#51060; &#51680; &#53076;&#46300;&#47484; &#50976;&#51648;/&#48372;&#49688;&#54644;&#50556; &#54616;&#45716; &#51077;&#51109;&#50640;&#49436;&#45716;, &#51204;&#50669; &#48320;&#49688;&#51032; &#45224;&#48156;&#51060; &#50501;&#51032;
&#54868;&#49888;&#51004;&#47196; &#45712;&#44788;&#51276;&#51012; &#44163;&#51060;&#45796;. &#44536;&#47000;&#49436; &#49324;&#46988;&#46308;&#51060; &#44061;&#52404;&#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;&#51004;&#47196; &#47566;&#51060; &#46028;&#50500;&#49456;&#45796;.  &#44536;&#47088;&#45936;
&#44061;&#52404; &#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;&#46020;, &#49444;&#44228;&#54616;&#44256;&#51088; &#54616;&#45716; &#53364;&#47000;&#49828;&#51032; &#53356;&#44592;&#44032; &#52964;&#51648;&#44144;&#45208;, &#45796;&#47480; &#53364;&#47000;&#49828;&#50640; &#51032;&#51316;&#54616;&#45716;
&#45236;&#48512; &#48320;&#49688;&#46308;&#51032; &#49688;&#44032; &#51613;&#44032;&#54624;&#49688;&#47197;, &#44536;&#47532;&#44256; &#49345;&#49549; &#44288;&#44228;&#44032; &#48373;&#51105;&#54644;&#51656;&#49688;&#47197;, &#53364;&#47000;&#49828; &#45236;&#48512; &#48320;&#49688;&#47484;
&#44148;&#46300;&#47532;&#45716; &#47716;&#48260; &#54632;&#49688;&#46308;&#51032; &#49688;&#44032; &#45908;&#48520;&#50612; &#51613;&#44032;&#54616;&#44592; &#47560;&#47144;&#51060;&#45796;. &#44536;&#47000;&#49436; &#44536; &#53364;&#47000;&#49828; &#45236;&#48512;&#51032; &#48320;&#49688;&#46308;&#51012;,
&#50612;&#46500; &#47716;&#48260; &#54632;&#49688; &#45236;&#50640;&#49436; &#44148;&#46300;&#47532;&#45716; &#51648; &#52628;&#51201;&#54616;&#45716; &#51068;&#46020; &#47564;&#47564;&#52824; &#50506;&#51008; &#51068;&#51060; &#46104;&#50612; &#48260;&#47536;&#45796;. &#51204;&#50669; &#48320;&#49688;
&#44288;&#47532;&#54624; &#46412;&#50752; &#48708;&#49847;&#54620; &#54788;&#49345;&#51060; &#45208;&#53440;&#45208;&#44592; &#49884;&#51089;&#54620;&#45796;&#45716; &#44163;&#51060;&#45796;.</p><p>&#50668;&#44592;&#49436; &#54620; &#44032;&#51648; &#51473;&#50836;&#54620; &#50896;&#47532;&#44032; &#48156;&#44204;&#46108;&#45796;.  &#44536;&#44163;&#51008; &#54532;&#47196;&#44536;&#47016;&#51032; &#48373;&#51105;&#46020;&#47484; &#51460;&#51060;&#44592; &#55064;&#54644;, &#48320;&#49688;&#51032;
&#44050;&#51012; &#48320;&#44221;&#54624; &#49688; &#51080;&#45716; &#54632;&#49688;&#46308;&#51032; &#48276;&#50948;&#47484; &#51216;&#51216; &#45908; &#51228;&#54620;&#54644; &#44032;&#44256; &#51080;&#45796;&#45716; &#44163;&#51060;&#45796;. &#44536;&#47111;&#45796;&#47732; &#49345;&#53468;&#47484;
&#50976;&#51648;&#54616;&#45716; &#48320;&#49688;&#44032; &#50500;&#50696; &#50630;&#45796;&#47732; &#50612;&#46523;&#44172; &#46112;&#44620;? &#48148;&#47196; &#51060;&#44163;&#51060; &#50836;&#51608;&#50640; &#46321;&#51109;&#54620; &#54632;&#49688;&#54805; &#50616;&#50612;&#46308;&#51060;
&#52628;&#44396;&#54616;&#45716; &#47785;&#54364;&#51060;&#45796;.</p><p>&#50668;&#44592;&#49436; &#54632;&#49688;&#54805; &#50616;&#50612;&#50640;&#49436;&#51032; immutable &#51088;&#47308;&#54805;&#51032; &#51652;&#44032;&#44032; &#46300;&#47084;&#45208;&#44172; &#46108;&#45796;. &#54632;&#49688;&#54805; &#50616;&#50612;&#50640;&#49436;&#45716;
&#49345;&#53468;(state)&#47484; &#51200;&#51109;&#54616;&#45716; &#48320;&#49688;&#51032; &#49324;&#50857;&#51012; &#52572;&#45824;&#54620; &#50630;&#50528;&#45716; &#44163;&#51012; &#47785;&#54364;&#47196; &#54620;&#45796;. &#54616;&#51648;&#47564;, &#49345;&#53468;&#47484;
&#51200;&#51109;&#54616;&#45716; &#48320;&#49688;&#47484; &#51204;&#54784; &#50504;&#50424; &#49688;&#45716; &#50630;&#45796;. &#44536;&#47000;&#49436; &#49345;&#53468;&#44050;&#51012; &#48320;&#44221;&#54616;&#45716; &#44219;&#51012; &#54728;&#50857;&#54616;&#45716; &#51109;&#52824;&#47484; &#46160;&#44592;&#45716;
&#54616;&#51648;&#47564;, &#51060;&#44163;&#51008; &#50724;&#55176;&#47140; &#50696;&#50808;&#51201;&#51064; &#49345;&#54889;&#51004;&#47196; &#44036;&#51452;&#46108;&#45796;.  &#44536;&#47111;&#44172; &#46104;&#47732; &#46356;&#48260;&#44613;&#54624; &#46412; &#46356;&#48260;&#44613;&#51032; &#45800;&#50948;&#44032;
&#54632;&#49688; &#54616;&#45208;&#47196; &#44397;&#54620;&#46108;&#45796;. &#44061;&#52404; &#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;&#50640;&#49436;&#50752;&#45716; &#45804;&#47532;, &#53364;&#47000;&#49828; &#45236;&#51032; &#45796;&#47480; &#47716;&#48260; &#54632;&#49688;&#44032;
&#53364;&#47000;&#49828;&#51032; &#45236;&#48512; &#48320;&#49688;&#47484; &#50616;&#51228; &#50612;&#46523;&#44172; &#44148;&#46300;&#47532;&#45716;&#51648; &#51204;&#54784; &#49888;&#44221;&#50424; &#54596;&#50836;&#44032; &#50630;&#44172; &#46108;&#45796;.</p><p>&#46384;&#46972;&#49436; '&#54532;&#47196;&#44536;&#47016;&#51032; &#48373;&#51105;&#46020;&#47484; &#51460;&#50668;&#51456;&#45796;'&#45716; &#51032;&#48120;&#47196;, &#44536;&#47532;&#44256; &#44536;&#44163;&#51012; &#49892;&#54788;&#54616;&#44592; &#50948;&#54644; immutable
&#51088;&#47308;&#54805;&#51012; &#44592;&#48376;&#51004;&#47196; &#51228;&#44277;&#54644;&#50556; &#54620;&#45796;&#45716; &#51032;&#48120;&#47196; &#54632;&#49688;&#54805; &#50616;&#50612;&#47484; &#51221;&#51032;&#54620;&#45796;&#47732;, Clojure&#45716; &#51652;&#51221;&#54620; &#51032;&#48120;&#47504;
&#54632;&#49688;&#54805; &#50616;&#51060;&#46972;&#44256; &#54624; &#49688; &#51080;&#45796;. &#48152;&#47732;&#50640; &#44536;&#47088; &#51032;&#48120;&#50640;&#49436; Common Lisp&#51008; &#50628;&#48128;&#54620; &#51032;&#48120;&#50640;&#49436;&#51032; &#54632;&#49688;&#54805;
&#50616;&#50612;&#45716; &#50500;&#45768;&#45796;.</p><h4>1.3<tt>&nbsp;</tt><a name="(part.______.Clojure______________)"></a>&#45208;&#45716; &#50780; Clojure&#47484; &#51452;&#47141; &#50616;&#50612;&#47196; &#49440;&#53469;&#54664;&#45208;?</h4><p>&#45236;&#44032; Clojure&#47484; &#52376;&#51020; &#51217;&#54664;&#51012; &#46412;&#51032; &#45712;&#45196;&#51008;, &#44536;&#46412;&#44620;&#51648; &#54632;&#44760; &#49828;&#53552;&#46356;&#54616;&#47732;&#49436; &#51061;&#55180; Common Lisp&#50640; &#48708;&#54644;
&#47956;&#44032; &#54728;&#51217;&#54616;&#44256;, &#47566;&#51060; &#45796;&#47476;&#45796;&#45716; &#51060;&#51656;&#44048;&#51060; &#44053;&#54616;&#44172; &#45712;&#44788;&#51256;&#49436; &#44144;&#48512;&#44048;&#51060; &#49900;&#54664;&#45912; &#44163;&#46020; &#49324;&#49892;&#51060;&#51648;&#47564;,
&#51648;&#44552;&#51008; &#49373;&#44033;&#51060; &#47566;&#51060; &#45804;&#46972;&#51276;&#45796;.</p><p>&#50836;&#51608;&#50640;&#45716; &#50724;&#55176;&#47140; Clojure&#44032; &#44057;&#51008; &#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#51064; Common Lisp&#51060;&#45208; Racket&#48372;&#45796; &#45227;&#45796;&#45716; &#49373;&#44033;&#51012;
&#47566;&#51060; &#54616;&#44172; &#46104;&#45716;&#45936;, &#44536; &#51060;&#50976;&#45716; &#53356;&#44172; &#46160;&#44032;&#51648;&#51060;&#45796;.</p><p>&#52395;&#48264;&#51704;&#47196; &#44032;&#51109; &#53360; &#51060;&#50976;&#45716;, Clojure&#44032; 'immutable' &#51088;&#47308;&#54805;&#51012; &#44592;&#48376;&#51004;&#47196; &#54616;&#45716; '&#54632;&#49688;&#54805;' &#50616;&#50612;&#51060;&#44256;,
&#44172;&#45796;&#44032; '&#47532;&#49845; &#44228;&#50676;' &#50616;&#50612;&#46972;&#45716; &#51216;&#51060;&#45796;. Clojure&#44032; 'immutable' &#51088;&#47308;&#54805;&#51012; &#44592;&#48376;&#51004;&#47196; &#54616;&#45716;
'&#54632;&#49688;&#54805;' &#50616;&#50612;&#44032; &#50500;&#45768;&#47732;&#49436;, &#45800;&#49692;&#55176; '&#47532;&#49845; &#44228;&#50676;' &#50616;&#50612;&#51068; &#49104;&#51060;&#50632;&#45796;&#47732;, &#51200;&#45716; Clojure&#47484; &#51648;&#44552;&#52376;&#47100;
&#45824;&#45800;&#55176; &#47588;&#47141;&#51201;&#51064; &#50616;&#50612;&#46972;&#44256; &#49373;&#44033;&#54616;&#51648;&#45716; &#50506;&#50520;&#51012; &#44163;&#51060;&#45796;. &#45800;&#49692;&#55176; Common Lisp, Racket, ... &#46321;&#46321;&#51032;
&#44536; &#49688;&#47566;&#51008; &#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#46308; &#51473;&#51032; &#54616;&#45208;&#46972;&#44256; &#50668;&#44220;&#51012; &#44163;&#51060;&#44256;, &#46384;&#46972;&#49436; &#48324; &#47588;&#47141;&#51012; &#45712;&#45180;&#51648; &#47803;&#54664;&#51012;
&#44163;&#51060;&#45796;. &#51648;&#44552; Clojure&#44032; Common Lisp&#51060;&#45208; Racket&#48372;&#45796; &#45227;&#45796;&#44256; &#49373;&#44033;&#54616;&#45716; &#51060;&#50976;&#44032; &#48148;&#47196;,
Clojure&#44032; 'immutable' &#51088;&#47308;&#54805;&#51012; &#44592;&#48376;&#51004;&#47196; &#54616;&#45716; '&#54632;&#49688;&#54805;' &#50616;&#50612;&#46972;&#45716; &#51216;&#51060;&#45796;.</p><p>&#51208;&#52264; &#51648;&#54693;&#51032; &#54532;&#47196;&#44536;&#47000;&#48141;&#51012; &#44537;&#48373;&#54616;&#44592; &#50948;&#54620; &#45824;&#50504;&#51004;&#47196; &#44061;&#52404;&#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;&#51060; &#45208;&#50772;&#45796;&#47732;, &#54632;&#49688;&#54805;
&#54532;&#47196;&#44536;&#47000;&#48141;&#51008; &#44061;&#52404;&#51648;&#54693; &#54532;&#47196;&#44536;&#47000;&#48141;&#50640;&#49436; &#45208;&#53440;&#45208;&#45716; &#47928;&#51228;&#51104;&#46308;&#51012; &#44537;&#48373;&#54616;&#44592; &#50948;&#54620; &#45824;&#50504;&#51004;&#47196; &#46321;&#51109;&#54664;&#44592;&#50640;,
&#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#46308;&#46020; &#51060; &#44060;&#45392;&#51012; &#46020;&#51077;&#54624; &#54596;&#50836;&#44032; &#51080;&#45796;&#44256; &#48376;&#45796;. &#44536;&#47088;&#45936; &#51060; &#54632;&#49688;&#54805; &#54532;&#47196;&#44536;&#47000;&#48141; &#54056;&#47084;&#45796;&#51076;&#51008;,
&#44592;&#51316;&#51032; &#54532;&#47196;&#44536;&#47000;&#48141; &#54056;&#47084;&#45796;&#51076;&#44284;&#45716; &#45320;&#47924;&#45208; &#45804;&#46972;&#49436;, '&#49345;&#53468;(state)&#47484; &#50976;&#51648;&#54616;&#45716; &#44163;&#51012; &#44592;&#48376; &#51204;&#51228;&#47196; &#54644;&#49436;
&#47564;&#46308;&#50612;&#51652;, &#44592;&#51316;&#51032; &#47532;&#49845; &#50616;&#50612;&#46308;'&#51012; &#54869;&#51109;&#54616;&#45716; &#48169;&#49885;&#48372;&#45796;&#45716;, Clojure&#52376;&#47100; &#49352;&#47196;&#50868; &#47532;&#49845; &#50616;&#50612;&#47484; &#47564;&#46300;&#45716; &#44163;&#51060;
&#45227;&#45796;&#44256; &#48376;&#45796;.</p><p>&#54632;&#49688;&#54805; &#50616;&#50612;&#51032; &#53945;&#51669;&#51060;, &#47532;&#49845;&#51032; &#51109;&#51216;&#44284; &#44208;&#54633;&#46112; &#49688; &#51080;&#45796;&#45716; &#51216;&#51008; Clojure&#47564;&#51060; &#51648;&#45772; &#50628;&#52397;&#45212;
&#51104;&#51116;&#47141;&#51060;&#45796;. &#44536;&#47532;&#44256; &#54632;&#49688;&#54805; &#54532;&#47196;&#44536;&#47000;&#48141;&#51012; &#51648;&#50896;&#54616;&#45716; &#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#44032;, &#54788;&#51116;&#47196;&#49436;&#45716; Clojure
&#54616;&#45208;&#48150;&#50640; &#50630;&#45796;&#45716; &#51216;&#51060; &#51228;&#44032; Clojure&#47484; &#51452;&#47141; &#50616;&#50612;&#47196; &#49440;&#53469;&#54644;&#50556; &#44192;&#45796;&#44256; &#44208;&#49900;&#51012; &#44403;&#55180; &#51060;&#50976;&#51060;&#44592;&#46020;
&#54616;&#45796;.</p><p>&#50669;&#51004;&#47196;, Clojure&#44032; &#47532;&#49845;&#44228;&#50676; &#50616;&#50612;&#44032; &#50500;&#45772; &#45800;&#49692;&#55176; &#54632;&#49688;&#54805; &#50616;&#50612;&#51068; &#49104;&#51060;&#50632;&#45796;&#47732;, &#50669;&#49884; &#45576;&#50668;&#44200; &#48372;&#51648;
&#50506;&#50520;&#51012; &#44163;&#51060;&#45796;. &#49556;&#51649;&#55176; &#51060;&#50556;&#44592;&#54616;&#47732;, &#47588;&#53356;&#47196;&#46972;&#45716; &#47532;&#49845;&#51032; &#51109;&#51216;&#51060; &#50630;&#45796;&#47732;, &#51228; &#50500;&#47924;&#47532; &#51339;&#51008; &#50616;&#50612;&#46972;&#46020;
&#45576;&#44600;&#51060; &#44032;&#51648;&#47484; &#50506;&#45716;&#45796;. &#44536;&#47532;&#44256; &#47588;&#53356;&#47196;&#47484; &#51648;&#50896;&#54616;&#47140;&#47732;, &#47532;&#49845; &#50616;&#50612;&#50640; &#46321;&#51109;&#54616;&#45716; &#44536; &#49688;&#47566;&#51008; &#44292;&#54840;
&#50630;&#51060;&#45716; &#48520;&#44032;&#45733;&#54616;&#45796;&#44256; &#48372;&#44592;&#50640;, &#44292;&#54840;&#44032; &#50630;&#51004;&#47732;&#49436; &#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#51076;&#51012; &#54364;&#48169;&#54616;&#45716; &#51088;&#52845; &#47532;&#49845; &#44228;&#50676;
&#50616;&#50612;&#46308;&#50640;&#44172;&#46020; &#49900;&#46300;&#47105;&#54644;&#51652;&#45796;.</p><p>&#46160; &#48264;&#51704;&#47196; Clojure&#44032; &#45796;&#47480; &#47532;&#49845;&#44228;&#50676; &#50616;&#50612;&#46308;&#50640; &#48708;&#54644; &#51339;&#45796;&#44256; &#49373;&#44033;&#54616;&#45716; &#51216;&#51008;, &#48148;&#47196; &#51060;&#50857; &#44032;&#45733;&#54620;
&#46972;&#51060;&#48652;&#47084;&#47532;&#51032; &#49688;&#45796;. Clojure&#45716; JVM&#50640;&#49436; &#46028;&#50500;&#44032;&#44592;&#50640;, &#44536; &#50628;&#52397;&#45208;&#44172; &#47566;&#51008; &#51088;&#48148; &#46972;&#51060;&#48652;&#47084;&#47532;&#46308;&#51012;
&#44536;&#45824;&#47196; &#48520;&#47084;&#45796; &#50424; &#49688; &#51080;&#45796;. &#44536;&#46041;&#50504; Common Lisp&#51060;&#45208; Racket&#51060; &#50616;&#50612; &#51088;&#52404;&#47196;&#45716; &#51339;&#45796;&#44256; &#54616;&#47732;&#49436;&#46020;
&#46972;&#51060;&#48652;&#47084;&#47532;&#51032; &#48512;&#51313; &#46412;&#47928;&#50640;, &#49892;&#51228;&#47196; &#51060; &#50616;&#50612;&#46308;&#51012; &#54876;&#50857;&#54616;&#45716; &#45936;&#50640;&#45716; &#54620;&#44228;&#44032; &#51080;&#51648; &#50506;&#50520;&#45912;&#44032;? &#50616;&#50612;&#44032;
&#50500;&#47924;&#47532; &#51339;&#50500;&#46020; &#51060;&#50857; &#44032;&#45733;&#54620; &#46972;&#51060;&#48652;&#47084;&#47532;&#51032; &#49688;&#44032; &#51201;&#51004;&#47732;, &#44536; &#54876;&#50857; &#44032;&#52824;&#45716; &#46504;&#50612;&#51648;&#44172; &#47560;&#47144;&#51064;&#45936;,
Clojure&#45716; &#44536; &#54620;&#44228;&#47484; &#44537;&#48373;&#54624; &#49688; &#51080;&#44172; &#54644;&#51452;&#45716; &#50976;&#51068;&#54620; &#47532;&#49845; &#44228;&#50676; &#50616;&#50612;&#51060;&#44592; &#46412;&#47928;&#50640;, &#45208;&#45716; Clojure&#47484;
&#45796;&#47480; &#47532;&#49845;&#44228;&#50676; &#50616;&#50612;&#48372;&#45796; &#45908; &#49440;&#54840;&#54620;&#45796;.</p><h4>1.4<tt>&nbsp;</tt><a name="(part._.Clojure__________)"></a>Clojure&#45716; &#50620;&#47560;&#45208; &#48736;&#47480;&#44032;?</h4><p>Java&#45716; C++&#50640; &#48708;&#54644; &#54217;&#44512;&#51201;&#51004;&#47196; 3&#48176; &#45712;&#47532;&#44256;, Clojure&#45716; Java&#50640; &#48708;&#54644; &#54217;&#44512;&#51201;&#51004;&#47196; 3&#48176; &#45712;&#47532;&#45796;&#44256;
&#54633;&#45768;&#45796;. &#44208;&#44284;&#51201;&#51004;&#47196; &#53364;&#47196;&#51200;&#45716; C++&#50640; &#48708;&#54644; 9&#48176; &#51221;&#46020; &#45712;&#47532;&#45796;&#44256; &#48372;&#47732; &#46108;&#45796;. &#54616;&#51648;&#47564; Python&#50640;
&#48708;&#54644;&#49436;&#45716; 30&#48176; &#51060;&#49345;
&#48736;&#47476;&#45796;(<a href="http://benchmarksgame.alioth.debian.org/u64q/compare.php?lang=python3&amp;lang2=clojure"><span class="url">http://benchmarksgame.alioth.debian.org/u64q/compare.php?lang=python3&amp;lang2=clojure</span></a>). &#53364;&#47196;&#51200;&#45716;
Compiler &#50616;&#50612;&#51060;&#44592; &#46412;&#47928;&#50640; &#49892;&#54665; &#49549;&#46020;&#44032; &#51064;&#53552;&#54532;&#47532;&#53552; &#50616;&#50612;&#50640; &#48708;&#54644; &#48736;&#47484; &#49688; &#48150;&#50640; &#50630;&#45796;. &#53364;&#47196;&#51200;
&#50616;&#50612;&#50640; &#45236;&#51109;&#46104;&#50612; &#51080;&#45716; &#53364;&#47196;&#51200; &#52980;&#54028;&#51068;&#47084;&#45716; &#53364;&#47196;&#51200; &#49548;&#49828; &#53076;&#46300;&#47484;, &#51088;&#48148; &#53076;&#46300;&#47484; &#44144;&#52824;&#51648;&#50506;&#44256;, JVM
&#48148;&#51060;&#53944; &#53076;&#46300;&#47196; &#51649;&#51217; &#52980;&#54028;&#51068;&#54620;&#45796;. &#44536;&#47532;&#44256; &#53364;&#47196;&#51200;&#45716; profiling&#51012; &#49892;&#54665;&#54620; &#54980;&#50640;, &#48337;&#47785; &#54788;&#49345;&#51060;
&#51068;&#50612;&#45208;&#45716; &#48512;&#48516;&#51032; &#53076;&#46300;&#50640; type hinting &#51221;&#48372;&#47484; &#52628;&#44032;&#54644; &#51452;&#47732; &#49892;&#54665; &#49549;&#46020;&#44032; &#54693;&#49345;&#46108;&#45796;. &#52280;&#44256;&#47196;, &#51088;&#48148;
&#53076;&#46300;&#47484; &#51649;&#51217; &#54840;&#52636;&#54616;&#45716; &#48512;&#48516;&#51008; &#51088;&#48148;&#50752; &#49892;&#55197; &#49549;&#46020;&#44032; &#46041;&#51068;&#54616;&#45796;.</p><p>&#44284;&#44144;&#50640; C &#50616;&#50612;&#47196; &#54532;&#47196;&#44536;&#47000;&#48141;&#51012; &#49884;&#51089;&#54620; &#49324;&#46988;&#46308;&#51008;, &#51068;&#48152;&#51201;&#51004;&#47196; &#54532;&#47196;&#44536;&#47016;&#51032; &#49892;&#54665; &#49549;&#46020;&#50640; &#47785;&#51012; &#47700;&#45716;
&#44221;&#54693;&#51060; &#51080;&#45716; &#45936;, &#49905;&#44544; &#53076;&#50612; &#49464;&#45824;&#50640;&#49436; &#47680;&#54000; &#53076;&#50612; &#49884;&#45824;&#47196; &#45336;&#50612;&#44032;&#44256; &#51080;&#45716; &#51060; &#49884;&#45824;&#50640;&#45716; &#49892;&#54665; &#49549;&#46020;&#51032;
&#44060;&#45392; &#51088;&#52404;&#44032; &#48148;&#45076; &#54596;&#50836;&#44032; &#51080;&#45796;. C++&#47196; &#51680; &#54532;&#47196;&#44536;&#47016;&#51060; &#48736;&#47476;&#45796;&#44256;&#45716; &#54644;&#46020;, &#49905;&#44544; &#53076;&#50612;&#50640;&#49436; &#46028;&#50500; &#44052;&#51012;
&#46412;&#51032; &#51060;&#50556;&#44592;&#51068; &#49104;&#51060;&#45796;. &#50696;&#47484; &#46308;&#50612; 64 &#53076;&#50612; &#49436;&#48260;&#50640;&#49436; C++ &#54532;&#47196;&#44536;&#47016;&#51012; &#46028;&#47140;&#46020;, 1&#44060;&#51032; &#53076;&#50612;&#47564; 100%
&#44032;&#44620;&#51060; &#46028;&#50500;&#44040; &#49104;, &#45208;&#47672;&#51648; &#53076;&#50612;&#46308;&#51008; &#45824;&#48512;&#48516; &#45440;&#44256; &#51080;&#45716;&#44172; &#54788;&#49892;&#51060;&#45796;. &#45800;&#49692; &#44228;&#49328;&#51060;&#44592;&#45716; &#54616;&#51648;&#47564;,
&#50948;&#50640;&#49436; &#46304; &#49549;&#46020; &#48708;&#44368;&#47196; &#44228;&#49328;&#47564; &#54644;&#46020;, &#54620; &#44060;&#51032; &#53364;&#47196;&#51200; &#54532;&#47196;&#44536;&#47016;&#51008; 64 &#53076;&#50612; &#47784;&#46160;&#47484; &#54876;&#50857;&#54624; &#49688;
&#51080;&#51004;&#48064;&#47196;, &#51204;&#52404;&#51201;&#51004;&#47196;&#45716; C++&#48372;&#45796; '9&#48176;&#44032; &#45712;&#47536;' &#44163;&#51060; &#50500;&#45768;&#46972;, '7&#48176; &#51060;&#49345; &#48736;&#47480;'
&#44163;&#51060;&#45796;. &#54616;&#46300;&#50920;&#50612;&#51032; &#49457;&#45733;&#51008; &#45208;&#45216;&#51060; &#45458;&#50500;&#51648;&#44256;, &#44032;&#44201;&#51008; &#45208;&#45216;&#51060; &#46504;&#50612;&#51648;&#44256; &#51080;&#51004;&#48064;&#47196;, &#47680;&#54000; &#53076;&#50612;&#47484;
&#51060;&#50857;&#54624; &#49688; &#51080;&#45716; &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612;&#44032; &#44208;&#44284;&#51201;&#51004;&#47196; &#45908; &#48736;&#47480; &#50616;&#50612;&#51064; &#44163;&#51060;&#45796;. CPU&#51032; &#53076;&#50612; &#49688;&#44032; &#45720;&#50612;&#45216;
&#49688;&#47197; &#44201;&#52264;&#45716; &#45908; &#48268;&#50612;&#51656; &#44163;&#51060;&#45796;. &#51060;&#50752; &#44057;&#51060; &#54532;&#47196;&#44536;&#47016;&#51032; '&#49549;&#46020;'&#46972;&#45716; &#44060;&#45392; &#51088;&#52404;&#47484; &#48148;&#44984;&#50612;&#50556;
&#54616;&#45716;&#45936;&#46020; &#48520;&#44396;&#54616;&#44256;, &#49324;&#46988;&#46308;&#51032; &#49373;&#44033;&#51008; &#45720; &#44288;&#49457;&#51201;&#51060;&#50612;&#49436;, &#51328;&#52376;&#47100; &#48148;&#45068;&#51648; &#50506;&#45716; &#44163; &#44057;&#45796;. &#51060;&#47111;&#44172;
&#53364;&#47196;&#51200; &#54532;&#47196;&#44536;&#47016;&#51060; &#47680;&#54000; &#53076;&#50612; &#47784;&#46160;&#47484; &#51060;&#50857;&#54624; &#49688; &#51080;&#45716; &#51060;&#50976;&#45716;, 1&#52264;&#51201;&#51004;&#47196;&#45716; immutable &#45936;&#51060;&#53552;
&#46412;&#47928;&#51060;&#44256;&#50836;, 2&#52264;&#51201;&#51004;&#47196;&#45716; &#53364;&#47196;&#51200; &#50616;&#50612; &#51088;&#52404;&#44032; &#50416;&#47112;&#46300;&#47484; &#51088;&#46041;&#51004;&#47196; &#52376;&#47532;&#54644;&#51452;&#45716; STM(Software
Transaction Memeory) &#44592;&#45733; &#46412;&#47928;&#51060;&#45796;.</p><p>&#47932;&#47200; 64 &#53076;&#50612; &#47784;&#46160;&#47484; &#51060;&#50857;&#54624; &#49688; &#51080;&#45716; C++ &#54532;&#47196;&#44536;&#47016;&#51012; &#51684; &#49688;&#46020; &#51080;&#51648; &#50506;&#45712;&#45264; &#48152;&#47928;&#54616;&#49884;&#45716; &#48516;&#46308;&#46020;
&#51080;&#51012;&#53584;&#45936;, &#44544;&#50052; &#44284;&#50672; &#44032;&#45733;&#54624;&#44620; &#51032;&#49900;&#49828;&#47101;&#45796;. &#49444;&#49324; &#44396;&#54788;&#54624; &#49688; &#51080;&#45796; &#54644;&#46020; &#50628;&#52397; &#48373;&#51105;&#54620; &#53076;&#46300;&#44032;
&#45208;&#50752;&#49436;, &#44537;&#49548;&#49688;&#51032; &#51204;&#47928;&#44032;&#44032; &#50500;&#45768;&#47732; &#50976;&#51648;/&#48372;&#49688;/&#44060;&#49440;&#51060; &#51221;&#49345;&#51201;&#51004;&#47196; &#51060;&#47336;&#50612;&#51648;&#44592;&#45716; &#50612;&#47140;&#50872; &#44163;&#51060;&#45796;.</p><div class="navsetbottom"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;</span><span class="navright">&nbsp;&nbsp;<a href="index.html" title="backward to &quot;Clojure Memo&quot;" data-pltdoc="x">&larr; prev</a>&nbsp;&nbsp;<a href="index.html" title="up to &quot;Clojure Memo&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="var.html" title="forward to &quot;2 Vars&quot;" data-pltdoc="x">next &rarr;</a></span>&nbsp;</div></div></div><div id="contextindicator">&nbsp;</div></body></html>